Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vndr_type.h
#ifndef _RTL8735B_VNDR_TYPE_H_
#define _RTL8735B_VNDR_TYPE_H_
#define VNDR_SHIFT_RSVD1                             0
#define VNDR_MASK_RSVD1                              ((u32)0xFFFFFFFF << 0)                              /*!<R 0   */

/**************************************************************************//**
 * @defgroup VNDR_REG_LOW_PRI_INT_MODE
 * @brief                                            (@ 0X004)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD2                             0
#define VNDR_MASK_RSVD2                              ((u32)0xFFFFFFFF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_LOW_PRI_INT_IMR
 * @brief                                            (@ 0X008)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD3                             0
#define VNDR_MASK_RSVD3                              ((u32)0xFFFFFFFF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_LOW_PRI_INT_ISR
 * @brief                                            (@ 0X00C)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD4                             0
#define VNDR_MASK_RSVD4                              ((u32)0xFFFFFFFF << 0)                              /*!<R 0   */
#define VNDR_SHIFT_RSVD5                             0
#define VNDR_MASK_RSVD5                              ((u32)0xFFFFFFFF << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_ANACK_CAL_CTRL
 * @brief                                            (@ 0X014)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_VDR_ANACK_CAL_CMD                 31
#define VNDR_BIT_VDR_ANACK_CAL_CMD                   ((u32)0x00000001 << 31)                             /*!<R/W 0  1: polling ANACK Calibration enable and indicate busy when calibration is on going 0: calibration is done */
#define VNDR_SHIFT_VDR_ANACK_CAL_SEL                 24
#define VNDR_MASK_VDR_ANACK_CAL_SEL                  ((u32)0x00000003 << 24)                             /*!<R/W 0  00: caliabration of 4M for 32 cycles 01: calibration of 128K for 8 cycles 10: calibration of 32K(S1) for 8 cycles 11: rsvd */
#define VNDR_SHIFT_VDR_ANACK_CAL_RPT                 0
#define VNDR_MASK_VDR_ANACK_CAL_RPT                  ((u32)0x0000FFFF << 0)                              /*!<R 0  the calibration value of ANA clock where the calibration clock is bus generic clock. */
#define VNDR_SHIFT_RSVD6                             0
#define VNDR_MASK_RSVD6                              ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
#define VNDR_SHIFT_RSVD7                             0
#define VNDR_MASK_RSVD7                              ((u32)0xFFFFFFFF << 0)                              /*!<-- 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_DATA_FIFO_SWAP_CTRL
 * @brief                                            (@ 0X020)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD8                             8
#define VNDR_MASK_RSVD8                              ((u32)0x00FFFFFF << 8)                              /*!<R/W 0  RSVD  */
#define VNDR_SHIFT_I2C3_RX_SHIFT_SWAP_EN             7
#define VNDR_BIT_I2C3_RX_BIT_SWAP_EN                 ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define VNDR_SHIFT_I2C3_TX_SHIFT_SWAP_EN             6
#define VNDR_BIT_I2C3_TX_BIT_SWAP_EN                 ((u32)0x00000001 << 6)                              /*!<R/W 0   */
#define VNDR_SHIFT_I2C2_RX_SHIFT_SWAP_EN             5
#define VNDR_BIT_I2C2_RX_BIT_SWAP_EN                 ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define VNDR_SHIFT_I2C2_TX_SHIFT_SWAP_EN             4
#define VNDR_BIT_I2C2_TX_BIT_SWAP_EN                 ((u32)0x00000001 << 4)                              /*!<R/W 0   */
#define VNDR_SHIFT_I2C1_RX_SHIFT_SWAP_EN             3
#define VNDR_BIT_I2C1_RX_BIT_SWAP_EN                 ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define VNDR_SHIFT_I2C1_TX_SHIFT_SWAP_EN             2
#define VNDR_BIT_I2C1_TX_BIT_SWAP_EN                 ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define VNDR_SHIFT_I2C0_RX_SHIFT_SWAP_EN             1
#define VNDR_BIT_I2C0_RX_BIT_SWAP_EN                 ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define VNDR_SHIFT_I2C0_TX_SHIFT_SWAP_EN             0
#define VNDR_BIT_I2C0_TX_BIT_SWAP_EN                 ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_I2C_DGLCH_CTRL
 * @brief                                            (@ 0X024)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD9                             0
#define VNDR_MASK_RSVD9                              ((u32)0xFFFFFFFF << 0)                              /*!<R 0  RSVD */
#define VNDR_SHIFT_RSVD10                            0
#define VNDR_MASK_RSVD10                             ((u32)0xFFFFFFFF << 0)                              /*!<-- 0   */
#define VNDR_SHIFT_RSVD11                            0
#define VNDR_MASK_RSVD11                             ((u32)0xFFFFFFFF << 0)                              /*!<-- 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_GDMA0_ISR
 * @brief                                            (@ 0X030)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD12                            6
#define VNDR_MASK_RSVD12                             ((u32)0x03FFFFFF << 6)                              /*!<-- 0   */
#define VNDR_SHIFT_GDMA0_CH5_ISR                     5
#define VNDR_BIT_GDMA0_CH5_ISR                       ((u32)0x00000001 << 5)                              /*!<R 0   */
#define VNDR_SHIFT_GDMA0_CH4_ISR                     4
#define VNDR_BIT_GDMA0_CH4_ISR                       ((u32)0x00000001 << 4)                              /*!<R 0   */
#define VNDR_SHIFT_GDMA0_CH3_ISR                     3
#define VNDR_BIT_GDMA0_CH3_ISR                       ((u32)0x00000001 << 3)                              /*!<R 0   */
#define VNDR_SHIFT_GDMA0_CH2_ISR                     2
#define VNDR_BIT_GDMA0_CH2_ISR                       ((u32)0x00000001 << 2)                              /*!<R 0   */
#define VNDR_SHIFT_GDMA0_CH1_ISR                     1
#define VNDR_BIT_GDMA0_CH1_ISR                       ((u32)0x00000001 << 1)                              /*!<R 0   */
#define VNDR_SHIFT_GDMA0_CH0_ISR                     0
#define VNDR_BIT_GDMA0_CH0_ISR                       ((u32)0x00000001 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_GDMA1_ISR
 * @brief                                            (@ 0X034)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD13                            6
#define VNDR_MASK_RSVD13                             ((u32)0x03FFFFFF << 6)                              /*!<-- 0   */
#define VNDR_SHIFT_GDMA1_CH5_ISR                     5
#define VNDR_BIT_GDMA1_CH5_ISR                       ((u32)0x00000001 << 5)                              /*!<R 0   */
#define VNDR_SHIFT_GDMA1_CH4_ISR                     4
#define VNDR_BIT_GDMA1_CH4_ISR                       ((u32)0x00000001 << 4)                              /*!<R 0   */
#define VNDR_SHIFT_GDMA1_CH3_ISR                     3
#define VNDR_BIT_GDMA1_CH3_ISR                       ((u32)0x00000001 << 3)                              /*!<R 0   */
#define VNDR_SHIFT_GDMA1_CH2_ISR                     2
#define VNDR_BIT_GDMA1_CH2_ISR                       ((u32)0x00000001 << 2)                              /*!<R 0   */
#define VNDR_SHIFT_GDMA1_CH1_ISR                     1
#define VNDR_BIT_GDMA1_CH1_ISR                       ((u32)0x00000001 << 1)                              /*!<R 0   */
#define VNDR_SHIFT_GDMA1_CH0_ISR                     0
#define VNDR_BIT_GDMA1_CH0_ISR                       ((u32)0x00000001 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_SGPIO_ISR
 * @brief                                            (@ 0X038)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD14                            1
#define VNDR_MASK_RSVD14                             ((u32)0x7FFFFFFF << 1)                              /*!<-- 0   */
#define VNDR_SHIFT_SGPIO0_ISR                        0
#define VNDR_BIT_SGPIO0_ISR                          ((u32)0x00000001 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_UART_ISR
 * @brief                                            (@ 0X03C)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD15                            5
#define VNDR_MASK_RSVD15                             ((u32)0x07FFFFFF << 5)                              /*!<-- 0   */
#define VNDR_SHIFT_BT_UART_ISR                       4
#define VNDR_BIT_BT_UART_ISR                         ((u32)0x00000001 << 4)                              /*!<R 0   */
#define VNDR_SHIFT_UART3_ISR                         3
#define VNDR_BIT_UART3_ISR                           ((u32)0x00000001 << 3)                              /*!<R 0   */
#define VNDR_SHIFT_UART2_ISR                         2
#define VNDR_BIT_UART2_ISR                           ((u32)0x00000001 << 2)                              /*!<R 0   */
#define VNDR_SHIFT_UART1_ISR                         1
#define VNDR_BIT_UART1_ISR                           ((u32)0x00000001 << 1)                              /*!<R 0   */
#define VNDR_SHIFT_UART0_ISR                         0
#define VNDR_BIT_UART0_ISR                           ((u32)0x00000001 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_I2C_ISR
 * @brief                                            (@ 0X040)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD16                            4
#define VNDR_MASK_RSVD16                             ((u32)0x0FFFFFFF << 4)                              /*!<-- 0   */
#define VNDR_SHIFT_I2C3_ISR                          3
#define VNDR_BIT_I2C3_ISR                            ((u32)0x00000001 << 3)                              /*!<R 0   */
#define VNDR_SHIFT_I2C2_ISR                          2
#define VNDR_BIT_I2C2_ISR                            ((u32)0x00000001 << 2)                              /*!<R 0   */
#define VNDR_SHIFT_I2C1_ISR                          1
#define VNDR_BIT_I2C1_ISR                            ((u32)0x00000001 << 1)                              /*!<R 0   */
#define VNDR_SHIFT_I2C0_ISR                          0
#define VNDR_BIT_I2C0_ISR                            ((u32)0x00000001 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_SPI_ISR
 * @brief                                            (@ 0X044)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD17                            2
#define VNDR_MASK_RSVD17                             ((u32)0x3FFFFFFF << 2)                              /*!<-- 0   */
#define VNDR_SHIFT_SPI1_ISR                          1
#define VNDR_BIT_SPI1_ISR                            ((u32)0x00000001 << 1)                              /*!<R 0   */
#define VNDR_SHIFT_SPI0_ISR                          0
#define VNDR_BIT_SPI0_ISR                            ((u32)0x00000001 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_I2S_ISR
 * @brief                                            (@ 0X048)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD18                            2
#define VNDR_MASK_RSVD18                             ((u32)0x3FFFFFFF << 2)                              /*!<-- 0   */
#define VNDR_SHIFT_I2S1_ISR                          1
#define VNDR_BIT_I2S1_ISR                            ((u32)0x00000001 << 1)                              /*!<R 0   */
#define VNDR_SHIFT_I2S0_ISR                          0
#define VNDR_BIT_I2S0_ISR                            ((u32)0x00000001 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_WL_ISR
 * @brief                                            (@ 0X04C)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSVD19                            4
#define VNDR_MASK_RSVD19                             ((u32)0x0FFFFFFF << 4)                              /*!<-- 0   */
#define VNDR_SHIFT_RF_OFF_ISR                        3
#define VNDR_BIT_RF_OFF_ISR                          ((u32)0x00000001 << 3)                              /*!<R 0  Without Use */
#define VNDR_SHIFT_RF_ON_ISR                         2
#define VNDR_BIT_RF_ON_ISR                           ((u32)0x00000001 << 2)                              /*!<R 0  Without Use */
#define VNDR_SHIFT_AHB_LOCAL_INT                     1
#define VNDR_BIT_AHB_LOCAL_INT                       ((u32)0x00000001 << 1)                              /*!<R 0  WL page3 interrupt */
#define VNDR_SHIFT_WLAN_PAGE0_INT                    0
#define VNDR_BIT_WLAN_PAGE0_INT                      ((u32)0x00000001 << 0)                              /*!<R 0   */
#define VNDR_SHIFT_RSVD20                            0
#define VNDR_MASK_RSVD20                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
#define VNDR_SHIFT_RSVD21                            0
#define VNDR_MASK_RSVD21                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
#define VNDR_SHIFT_RSVD22                            0
#define VNDR_MASK_RSVD22                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
#define VNDR_SHIFT_RSVD23                            0
#define VNDR_MASK_RSVD23                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_GDMA_HSKS_CTRL
 * @brief                                            (@ 0X060)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_HS_GDMA_HSKS_CFG                  0
#define VNDR_MASK_HS_GDMA_HSKS_CFG                   ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  GDMA handshake signal mapping. Some peripherals can operate with either GDMA0 or GDMA1. This mapping decides DMA handshake signal connection. If Nth bit is 0, the peripheral's DMA handshake signal is connected to GDMA0; if Nth bit is 1, the peripheral's DMA handshake signal is connected to GDMA1. Peripheral and GDMA handshake signal connection option is as in below table. */
#define VNDR_SHIFT_RSVD24                            0
#define VNDR_MASK_RSVD24                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
#define VNDR_SHIFT_RSVD25                            0
#define VNDR_MASK_RSVD25                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
#define VNDR_SHIFT_RSVD26                            0
#define VNDR_MASK_RSVD26                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
#define VNDR_SHIFT_MAILB0X_OUT_DATA                  0
#define VNDR_MASK_MAILB0X_OUT_DATA                   ((u32)0xFFFFFFFF << 0)                              /*!<R/W 010  Mailbox out data */
#define VNDR_SHIFT_RSVD27                            0
#define VNDR_MASK_RSVD27                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Reserved */
#define VNDR_SHIFT_RSVD28                            0
#define VNDR_MASK_RSVD28                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Reserved */
#define VNDR_SHIFT_RSVD29                            0
#define VNDR_MASK_RSVD29                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
#define VNDR_SHIFT_RSVD30                            0
#define VNDR_MASK_RSVD30                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
#define VNDR_SHIFT_RSVD31                            0
#define VNDR_MASK_RSVD31                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
#define VNDR_SHIFT_RSVD32                            0
#define VNDR_MASK_RSVD32                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
#define VNDR_SHIFT_RSVD33                            0
#define VNDR_MASK_RSVD33                             ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  Reserved */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_LX_CTRL0
 * @brief                                            (@ 0X090)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT__                                 19
#define VNDR_MASK__                                  ((u32)0x00001FFF << 19)                             /*!<R/W 0   */
#define VNDR_SHIFT_MII_LX_TIMEOUT_THRESHOLD          17
#define VNDR_MASK_MII_LX_TIMEOUT_THRESHOLD           ((u32)0x00000003 << 17)                             /*!<R/W 0  2'b00: 2^15 lexra clock cycles 2'b01: 2^13 lexra clock cycles 2'b10: 2^11 lexra clock cycles 2'b11: 2^9 lexra clock cycles */
#define VNDR_SHIFT_MII_LX_TIMEOUT_EN                 16
#define VNDR_BIT_MII_LX_TIMEOUT_EN                   ((u32)0x00000001 << 16)                             /*!<R/W 1  1:Enable */
#define VNDR_SHIFT_RSVD34                            10
#define VNDR_MASK_RSVD34                             ((u32)0x0000003F << 10)                             /*!<    */
#define VNDR_SHIFT_LX2_DMA_LOCK_DONE                 9
#define VNDR_BIT_LX2_DMA_LOCK_DONE                   ((u32)0x00000001 << 9)                              /*!<R 0  1'b1: lock is done. There is no dma transaction now. */
#define VNDR_SHIFT_LX2_DMA_LOCK_EN                   8
#define VNDR_BIT_LX2_DMA_LOCK_EN                     ((u32)0x00000001 << 8)                              /*!<R/W 0  1'b1: set gnt=0 to lock lexra dma function. */
#define VNDR_SHIFT_PCM1_LX_REQ_EN                    7
#define VNDR_BIT_PCM1_LX_REQ_EN                      ((u32)0x00000001 << 7)                              /*!<R/W 1  1: Enable */
#define VNDR_SHIFT_PCM0_LX_REQ_EN                    6
#define VNDR_BIT_PCM0_LX_REQ_EN                      ((u32)0x00000001 << 6)                              /*!<R/W 1  1: Enable */
#define VNDR_SHIFT_PCM_SPDUP_EN                      5
#define VNDR_BIT_PCM_SPDUP_EN                        ((u32)0x00000001 << 5)                              /*!<R/W 0  PCM speedup enable, only for test mode. */
#define VNDR_SHIFT_LX1_DMA_LOCK_DONE                 4
#define VNDR_BIT_LX1_DMA_LOCK_DONE                   ((u32)0x00000001 << 4)                              /*!<R 0  1'b1: lock is done. There is no dma transaction now. */
#define VNDR_SHIFT_LX1_DMA_LOCK_EN                   3
#define VNDR_BIT_LX1_DMA_LOCK_EN                     ((u32)0x00000001 << 3)                              /*!<R/W 0  1'b1: set gnt=0 to lock lexra dma function. */
#define VNDR_SHIFT_LX_BUS_TIMEOUT_THRESHOLD          1
#define VNDR_MASK_LX_BUS_TIMEOUT_THRESHOLD           ((u32)0x00000003 << 1)                              /*!<R/W 0  2'b00: 2^15 lexra clock cycles 2'b01: 2^13 lexra clock cycles 2'b10: 2^11 lexra clock cycles 2'b11: 2^9 lexra clock cycles */
#define VNDR_SHIFT_LX_BUS_TIMEOUT_EN                 0
#define VNDR_BIT_LX_BUS_TIMEOUT_EN                   ((u32)0x00000001 << 0)                              /*!<R/W 0  1:Enable */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_LX_CTRL1
 * @brief                                            (@ 0X094)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_R_LX1_TO_ADDR_MST                 0
#define VNDR_MASK_R_LX1_TO_ADDR_MST                  ((u32)0xFFFFFFFF << 0)                              /*!<R 0  The address when lexra master is hanged. */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_LX_CTRL2
 * @brief                                            (@ 0X098)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_R_LX1_TO_ADDR_SLV                 0
#define VNDR_MASK_R_LX1_TO_ADDR_SLV                  ((u32)0xFFFFFFFF << 0)                              /*!<R 0  The address when lexra slave is hanged. */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_LX_CTRL3
 * @brief                                            (@ 0X09C)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_R_LX2_TO_ADDR_MST                 0
#define VNDR_MASK_R_LX2_TO_ADDR_MST                  ((u32)0xFFFFFFFF << 0)                              /*!<R 0  The address when lexra master is hanged. */
/** @} */

