Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vndr_type.h
/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_RSTN_RAM_2
 * @brief                                            (@ 0X0A8)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSTN_VOE_FBCU_OBUF_BUF1           31
#define VNDR_BIT_RSTN_VOE_FBCU_OBUF_BUF1             ((u32)0x00000001 << 31)                             /*!<R/W 0x0  mbist_voe_fbcu_obuf_buf1 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_VOE_FBCU_OBUF_BUF0           30
#define VNDR_BIT_RSTN_VOE_FBCU_OBUF_BUF0             ((u32)0x00000001 << 30)                             /*!<R/W 0x0  mbist_voe_fbcu_obuf_buf0 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_VOE_SHARED_SRAM              29
#define VNDR_BIT_RSTN_VOE_SHARED_SRAM                ((u32)0x00000001 << 29)                             /*!<R/W 0x0  mbist_voe_shared_sram 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_VOEMCU_DTCM                  28
#define VNDR_BIT_RSTN_VOEMCU_DTCM                    ((u32)0x00000001 << 28)                             /*!<R/W 0x0  mbist_voemcu_dtcm 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_VOEMCU_ITCM_RAM              27
#define VNDR_BIT_RSTN_VOEMCU_ITCM_RAM                ((u32)0x00000001 << 27)                             /*!<R/W 0x0  mbist_voemcu_itcm_ram 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_CPU_ITCM_RAM                 26
#define VNDR_BIT_RSTN_CPU_ITCM_RAM                   ((u32)0x00000001 << 26)                             /*!<R/W 0x0  mbist_cpu_itcm_ram 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_CPU_PHT_BTB                  25
#define VNDR_BIT_RSTN_CPU_PHT_BTB                    ((u32)0x00000001 << 25)                             /*!<R/W 0x0  mbist_cpu_pht_btb 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_CPU_IC                       24
#define VNDR_BIT_RSTN_CPU_IC                         ((u32)0x00000001 << 24)                             /*!<R/W 0x0  mbist_cpu_ic 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_CPU_DC                       23
#define VNDR_BIT_RSTN_CPU_DC                         ((u32)0x00000001 << 23)                             /*!<R/W 0x0  mbist_cpu_dc 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_CPU_DTCM_RAM                 22
#define VNDR_BIT_RSTN_CPU_DTCM_RAM                   ((u32)0x00000001 << 22)                             /*!<R/W 0x0  mbist_cpu_dtcm_ram 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_SDMMC_PPBECC                 21
#define VNDR_BIT_RSTN_SDMMC_PPBECC                   ((u32)0x00000001 << 21)                             /*!<R/W 0x0  mbist_sdmmc_ppbecc 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_SDMMC_DMASB1                 20
#define VNDR_BIT_RSTN_SDMMC_DMASB1                   ((u32)0x00000001 << 20)                             /*!<R/W 0x0  mbist_sdmmc_dmasb1 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_USBOTG                       19
#define VNDR_BIT_RSTN_USBOTG                         ((u32)0x00000001 << 19)                             /*!<R/W 0x0  mbist_usbotg 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_SDIO                         18
#define VNDR_BIT_RSTN_SDIO                           ((u32)0x00000001 << 18)                             /*!<R/W 0x0  mbist_sdio 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_MIPI                         17
#define VNDR_BIT_RSTN_MIPI                           ((u32)0x00000001 << 17)                             /*!<R/W 0x0  mbist_mipi 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_OSDBRIDGE                    16
#define VNDR_BIT_RSTN_OSDBRIDGE                      ((u32)0x00000001 << 16)                             /*!<R/W 0x0  mbist_osdbridge 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_OSDPAINTER                   15
#define VNDR_BIT_RSTN_OSDPAINTER                     ((u32)0x00000001 << 15)                             /*!<R/W 0x0  mbist_osdpainter 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_VIDEO_AMBA                   14
#define VNDR_BIT_RSTN_VIDEO_AMBA                     ((u32)0x00000001 << 14)                             /*!<R/W 0x0  mbist_video_amba 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ISP_DMA3                     13
#define VNDR_BIT_RSTN_ISP_DMA3                       ((u32)0x00000001 << 13)                             /*!<R/W 0x0  mbist_isp_dma3 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ISPH_VHDR_ADD                12
#define VNDR_BIT_RSTN_ISPH_VHDR_ADD                  ((u32)0x00000001 << 12)                             /*!<R/W 0x0  mbist_isph VHDR add 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ISPG                         11
#define VNDR_BIT_RSTN_ISPG                           ((u32)0x00000001 << 11)                             /*!<R/W 0x0  mbist_ispg 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ISPF                         10
#define VNDR_BIT_RSTN_ISPF                           ((u32)0x00000001 << 10)                             /*!<R/W 0x0  mbist_ispf 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ISPE                         9
#define VNDR_BIT_RSTN_ISPE                           ((u32)0x00000001 << 9)                              /*!<R/W 0x0  mbist_ispe 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ISPD                         8
#define VNDR_BIT_RSTN_ISPD                           ((u32)0x00000001 << 8)                              /*!<R/W 0x0  mbist_ispd 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ISPC                         7
#define VNDR_BIT_RSTN_ISPC                           ((u32)0x00000001 << 7)                              /*!<R/W 0x0  mbist_ispc 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ISPB                         6
#define VNDR_BIT_RSTN_ISPB                           ((u32)0x00000001 << 6)                              /*!<R/W 0x0  mbist_ispb 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ISPA                         5
#define VNDR_BIT_RSTN_ISPA                           ((u32)0x00000001 << 5)                              /*!<R/W 0x0  mbist_ispa 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_GMAC_SRAM                    4
#define VNDR_BIT_RSTN_GMAC_SRAM                      ((u32)0x00000001 << 4)                              /*!<R/W 0x0  mbist_gmac_sram 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_BT_CPU                       3
#define VNDR_BIT_RSTN_BT_CPU                         ((u32)0x00000001 << 3)                              /*!<R/W 0x0  mbist_bt_cpu 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_BT_07                        2
#define VNDR_BIT_RSTN_BT_07                          ((u32)0x00000001 << 2)                              /*!<R/W 0x0  mbist_bt_07 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_BT_06                        1
#define VNDR_BIT_RSTN_BT_06                          ((u32)0x00000001 << 1)                              /*!<R/W 0x0  mbist_bt_06 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_BT_05                        0
#define VNDR_BIT_RSTN_BT_05                          ((u32)0x00000001 << 0)                              /*!<R/W 0x0  mbist_bt_05 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_RSTN_RAM_3
 * @brief                                            (@ 0X0AC)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSTN_ENC_GROUP05_1                31
#define VNDR_BIT_RSTN_ENC_GROUP05_1                  ((u32)0x00000001 << 31)                             /*!<R/W 0x0  mbist_enc_group05_1 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP04                  30
#define VNDR_BIT_RSTN_ENC_GROUP04                    ((u32)0x00000001 << 30)                             /*!<R/W 0x0  mbist_enc_group04 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP03_2                29
#define VNDR_BIT_RSTN_ENC_GROUP03_2                  ((u32)0x00000001 << 29)                             /*!<R/W 0x0  mbist_enc_group03_2 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP03_1                28
#define VNDR_BIT_RSTN_ENC_GROUP03_1                  ((u32)0x00000001 << 28)                             /*!<R/W 0x0  mbist_enc_group03_1 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP02                  27
#define VNDR_BIT_RSTN_ENC_GROUP02                    ((u32)0x00000001 << 27)                             /*!<R/W 0x0  mbist_enc_group02 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP01                  26
#define VNDR_BIT_RSTN_ENC_GROUP01                    ((u32)0x00000001 << 26)                             /*!<R/W 0x0  mbist_enc_group01 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_RXI316_1P                    25
#define VNDR_BIT_RSTN_RXI316_1P                      ((u32)0x00000001 << 25)                             /*!<R/W 0x0  mbist_rxi316_1p 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_RXI316_2P                    24
#define VNDR_BIT_RSTN_RXI316_2P                      ((u32)0x00000001 << 24)                             /*!<R/W 0x0  mbist_rxi316_2p 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_PLATFORM_GRP                 23
#define VNDR_BIT_RSTN_PLATFORM_GRP                   ((u32)0x00000001 << 23)                             /*!<R/W 0x0  mbist_platform_grp 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_SHARE_MEM_BT                 22
#define VNDR_BIT_RSTN_SHARE_MEM_BT                   ((u32)0x00000001 << 22)                             /*!<R/W 0x0  mbist_share_mem_bt 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_ACLK                      21
#define VNDR_BIT_RSTN_NN_ACLK                        ((u32)0x00000001 << 21)                             /*!<R/W 0x0  mbist_nn_ACLK 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKSH_DIV2                20
#define VNDR_BIT_RSTN_NN_CLKSH_DIV2                  ((u32)0x00000001 << 20)                             /*!<R/W 0x0  mbist_nn_clkSh_div2 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G17               19
#define VNDR_BIT_RSTN_NN_CLKCORE_G17                 ((u32)0x00000001 << 19)                             /*!<R/W 0x0  mbist_nn_clkCore_g17 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G16               18
#define VNDR_BIT_RSTN_NN_CLKCORE_G16                 ((u32)0x00000001 << 18)                             /*!<R/W 0x0  mbist_nn_clkCore_g16 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G15               17
#define VNDR_BIT_RSTN_NN_CLKCORE_G15                 ((u32)0x00000001 << 17)                             /*!<R/W 0x0  mbist_nn_clkCore_g15 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G14               16
#define VNDR_BIT_RSTN_NN_CLKCORE_G14                 ((u32)0x00000001 << 16)                             /*!<R/W 0x0  mbist_nn_clkCore_g14 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G13               15
#define VNDR_BIT_RSTN_NN_CLKCORE_G13                 ((u32)0x00000001 << 15)                             /*!<R/W 0x0  mbist_nn_clkCore_g13 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G12               14
#define VNDR_BIT_RSTN_NN_CLKCORE_G12                 ((u32)0x00000001 << 14)                             /*!<R/W 0x0  mbist_nn_clkCore_g12 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G11               13
#define VNDR_BIT_RSTN_NN_CLKCORE_G11                 ((u32)0x00000001 << 13)                             /*!<R/W 0x0  mbist_nn_clkCore_g11 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G10               12
#define VNDR_BIT_RSTN_NN_CLKCORE_G10                 ((u32)0x00000001 << 12)                             /*!<R/W 0x0  mbist_nn_clkCore_g10 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G9                11
#define VNDR_BIT_RSTN_NN_CLKCORE_G9                  ((u32)0x00000001 << 11)                             /*!<R/W 0x0  mbist_nn_clkCore_g9 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G8                10
#define VNDR_BIT_RSTN_NN_CLKCORE_G8                  ((u32)0x00000001 << 10)                             /*!<R/W 0x0  mbist_nn_clkCore_g8 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G7                9
#define VNDR_BIT_RSTN_NN_CLKCORE_G7                  ((u32)0x00000001 << 9)                              /*!<R/W 0x0  mbist_nn_clkCore_g7 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G6                8
#define VNDR_BIT_RSTN_NN_CLKCORE_G6                  ((u32)0x00000001 << 8)                              /*!<R/W 0x0  mbist_nn_clkCore_g6 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G5                7
#define VNDR_BIT_RSTN_NN_CLKCORE_G5                  ((u32)0x00000001 << 7)                              /*!<R/W 0x0  mbist_nn_clkCore_g5 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G4                6
#define VNDR_BIT_RSTN_NN_CLKCORE_G4                  ((u32)0x00000001 << 6)                              /*!<R/W 0x0  mbist_nn_clkCore_g4 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G3                5
#define VNDR_BIT_RSTN_NN_CLKCORE_G3                  ((u32)0x00000001 << 5)                              /*!<R/W 0x0  mbist_nn_clkCore_g3 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G2                4
#define VNDR_BIT_RSTN_NN_CLKCORE_G2                  ((u32)0x00000001 << 4)                              /*!<R/W 0x0  mbist_nn_clkCore_g2 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G1                3
#define VNDR_BIT_RSTN_NN_CLKCORE_G1                  ((u32)0x00000001 << 3)                              /*!<R/W 0x0  mbist_nn_clkCore_g1 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_NN_CLKCORE_G0                2
#define VNDR_BIT_RSTN_NN_CLKCORE_G0                  ((u32)0x00000001 << 2)                              /*!<R/W 0x0  mbist_nn_clkCore_g0 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_VOE_CPU_DCACHE               1
#define VNDR_BIT_RSTN_VOE_CPU_DCACHE                 ((u32)0x00000001 << 1)                              /*!<R/W 0x0  mbist_voe_cpu_dcache 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_VOE_CPU_ICACHE               0
#define VNDR_BIT_RSTN_VOE_CPU_ICACHE                 ((u32)0x00000001 << 0)                              /*!<R/W 0x0  mbist_voe_cpu_icache 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
/** @} */

