Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vndr_type.h
/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_RSTN_RAM_4
 * @brief                                            (@ 0X0B0)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED9                         16
#define VNDR_MASK_RESERVED9                          ((u32)0x0000FFFF << 16)                             /*!<R 0x0   */
#define VNDR_SHIFT_RSTN_BSTC_HWPAT                   15
#define VNDR_BIT_RSTN_BSTC_HWPAT                     ((u32)0x00000001 << 15)                             /*!<R/W 0x0  mbist_bstc_hwpat 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_RSA                          14
#define VNDR_BIT_RSTN_RSA                            ((u32)0x00000001 << 14)                             /*!<R/W 0x0  mbist_RSA 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP14                  13
#define VNDR_BIT_RSTN_ENC_GROUP14                    ((u32)0x00000001 << 13)                             /*!<R/W 0x0  mbist_enc_group14 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP13_2                12
#define VNDR_BIT_RSTN_ENC_GROUP13_2                  ((u32)0x00000001 << 12)                             /*!<R/W 0x0  mbist_enc_group13_2 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP13_1                11
#define VNDR_BIT_RSTN_ENC_GROUP13_1                  ((u32)0x00000001 << 11)                             /*!<R/W 0x0  mbist_enc_group13_1 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP12_2                10
#define VNDR_BIT_RSTN_ENC_GROUP12_2                  ((u32)0x00000001 << 10)                             /*!<R/W 0x0  mbist_enc_group12_2 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP12_1                9
#define VNDR_BIT_RSTN_ENC_GROUP12_1                  ((u32)0x00000001 << 9)                              /*!<R/W 0x0  mbist_enc_group12_1 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP11_2                8
#define VNDR_BIT_RSTN_ENC_GROUP11_2                  ((u32)0x00000001 << 8)                              /*!<R/W 0x0  mbist_enc_group11_2 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP11_1                7
#define VNDR_BIT_RSTN_ENC_GROUP11_1                  ((u32)0x00000001 << 7)                              /*!<R/W 0x0  mbist_enc_group11_1 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP10_2                6
#define VNDR_BIT_RSTN_ENC_GROUP10_2                  ((u32)0x00000001 << 6)                              /*!<R/W 0x0  mbist_enc_group10_2 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP10_1                5
#define VNDR_BIT_RSTN_ENC_GROUP10_1                  ((u32)0x00000001 << 5)                              /*!<R/W 0x0  mbist_enc_group10_1 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP09                  4
#define VNDR_BIT_RSTN_ENC_GROUP09                    ((u32)0x00000001 << 4)                              /*!<R/W 0x0  mbist_enc_group09 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP08                  3
#define VNDR_BIT_RSTN_ENC_GROUP08                    ((u32)0x00000001 << 3)                              /*!<R/W 0x0  mbist_enc_group08 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP07                  2
#define VNDR_BIT_RSTN_ENC_GROUP07                    ((u32)0x00000001 << 2)                              /*!<R/W 0x0  mbist_enc_group07 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP06                  1
#define VNDR_BIT_RSTN_ENC_GROUP06                    ((u32)0x00000001 << 1)                              /*!<R/W 0x0  mbist_enc_group06 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ENC_GROUP05_2                0
#define VNDR_BIT_RSTN_ENC_GROUP05_2                  ((u32)0x00000001 << 0)                              /*!<R/W 0x0  mbist_enc_group05_2 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_RSTN_ROM
 * @brief                                            (@ 0X0B4)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED10                        6
#define VNDR_BIT_RESERVED10                          ((u32)0x00000001 << 6)                              /*!<R 0x0   */
#define VNDR_SHIFT_RSTN_PLATFORM_ROM_GRP             6
#define VNDR_BIT_RSTN_PLATFORM_ROM_GRP               ((u32)0x00000001 << 6)                              /*!<R/W 0x0  mbist_platform_rom_grp 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_VOEMCU_ITCM_ROM              5
#define VNDR_BIT_RSTN_VOEMCU_ITCM_ROM                ((u32)0x00000001 << 5)                              /*!<R/W 0x0  mbist_voemcu_itcm_rom 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_VOEMCU_DTCM_ROM              4
#define VNDR_BIT_RSTN_VOEMCU_DTCM_ROM                ((u32)0x00000001 << 4)                              /*!<R/W 0x0  mbist_voemcu_dtcm_rom 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_CPU_ITCM_ROM                 3
#define VNDR_BIT_RSTN_CPU_ITCM_ROM                   ((u32)0x00000001 << 3)                              /*!<R/W 0x0  mbist_cpu_itcm_rom 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_CPU_DTCM_ROM                 2
#define VNDR_BIT_RSTN_CPU_DTCM_ROM                   ((u32)0x00000001 << 2)                              /*!<R/W 0x0  mbist_cpu_dtcm_rom 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_BT_01                        1
#define VNDR_BIT_RSTN_BT_01                          ((u32)0x00000001 << 1)                              /*!<R/W 0x0  mbist_bt_01 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMCU_IROM                   0
#define VNDR_BIT_RSTN_WLMCU_IROM                     ((u32)0x00000001 << 0)                              /*!<R/W 0x0  mbist_wlmcu_irom 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_CTRL_0
 * @brief                                            (@ 0X0B8)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED11                        12
#define VNDR_MASK_RESERVED11                         ((u32)0x000FFFFF << 12)                             /*!<-- 0x0   */
#define VNDR_SHIFT_ROM_RPT_SEL                       7
#define VNDR_MASK_ROM_RPT_SEL                        ((u32)0x0000001F << 7)                              /*!<R/W 0x0  select the BISR from the rom cell: //=========mbist_wlmcu_irom============ 5'b00000 : WLAN_rom_32768X32M32F80 //=========mbist_bt_01================ 5'b00001: rom32kx32_0 5'b00010:rom32kx32_1 5'b00011:rom8kx32 //=========mbist_cpu_dtcm_rom========== 5'b00100:tm9_rom_2048x64_0 5'b00101:tm9_rom_2048x64_1 5'b00110:tm9_rom_2048x64_2 5'b00111:tm9_rom_2048x64_3 5'b01000:tm9_rom_2048x64_4 //=========mbist_cpu_itcm_rom========== 5'b01001:tm9_rom_4096x64 //=========mbist_voemcu_dtcm_rom====== 5'b01010:VOE_rom_4096x32 //========mbist _voemcu_itcm_rom======= 5'b01011:VOE_rom_256x32m8F250 //========mbist_platform_rom_grp======== 5'b01100:platform_rom_16384x64_0 5'b01101:platform_rom_16384x64_1 5'b01110:platform_rom_16384x64_2 5'b01111:platform_rom_16384x64_3 5'b10000:platform_rom_16384x64_4 5'b10001:platform_rom_16384x64_5  */
#define VNDR_SHIFT_BIST_LOOP_MODE                    6
#define VNDR_BIT_BIST_LOOP_MODE                      ((u32)0x00000001 << 6)                              /*!<R/W 0x0  test looping capability 1: enable loop_mode 0: disable loop_mode */
#define VNDR_SHIFT_DYN_READ_EN                       5
#define VNDR_BIT_DYN_READ_EN                         ((u32)0x00000001 << 5)                              /*!<R/W 0x0  VDDR test enable 1: enable vddr test 0: disable vddr test */
#define VNDR_SHIFT_BIST_DRF_RESUME                   4
#define VNDR_BIT_BIST_DRF_RESUME                     ((u32)0x00000001 << 4)                              /*!<R/W 0x0  resume drf test: 1: stop waiting and resume drf test 0: keep waiting */
#define VNDR_SHIFT_BIST_DRF_MODE                     3
#define VNDR_BIT_BIST_DRF_MODE                       ((u32)0x00000001 << 3)                              /*!<R/W 0x0  enter DRF_MBIST mode 1: enable drf_mbist test 0: disable drf_mbist test */
#define VNDR_SHIFT_BIST_NRML_MODE                    2
#define VNDR_BIT_BIST_NRML_MODE                      ((u32)0x00000001 << 2)                              /*!<R/W 0x0  enter normal mbist mode 1: enable normal mbist test 0: disable normal mbist test */
#define VNDR_SHIFT_BIST_RSTN                         1
#define VNDR_BIT_BIST_RSTN                           ((u32)0x00000001 << 1)                              /*!<R/W 0x0  eable bist function 1: anable the bist block 0: keep in normal mode */
#define VNDR_SHIFT_BIST_CLK_EN_0                     0
#define VNDR_BIT_BIST_CLK_EN_0                       ((u32)0x00000001 << 0)                              /*!<R/W 0x0  eable bist clock for the mbist group 1: anable the bist clock 0: keep gating the clock */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_CTRL_1
 * @brief                                            (@ 0X0BC)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED12                        27
#define VNDR_MASK_RESERVED12                         ((u32)0x0000001F << 27)                             /*!<-- 0x0   */
#define VNDR_SHIFT_BIST_GRP_EN                       0
#define VNDR_MASK_BIST_GRP_EN                        ((u32)0x07FFFFFF << 0)                              /*!<R/W 0x0  enable each memory cell in one mbist group 1: enable the cell 0: disable the memory cell */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_CTRL_2
 * @brief                                            (@ 0X0C0)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED13                        0
#define VNDR_MASK_RESERVED13                         ((u32)0xFFFFFFFF << 0)                              /*!<R 0x0  Reserved */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_STATUS
 * @brief                                            (@ 0X0C4)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED14                        5
#define VNDR_MASK_RESERVED14                         ((u32)0x07FFFFFF << 5)                              /*!<R 0x0   */
#define VNDR_SHIFT_MBIST_START_PAUSE                 4
#define VNDR_BIT_MBIST_START_PAUSE                   ((u32)0x00000001 << 4)                              /*!<R 0x1  indicate whether the drf test is paused 1: test is paused and wait for the next pattern 0: ends waiting and continue the test */
#define VNDR_SHIFT_MBIST_NRML_DONE                   3
#define VNDR_BIT_MBIST_NRML_DONE                     ((u32)0x00000001 << 3)                              /*!<R 0x1  indicate whether the normal mbist test is done 1: normal_test is done 0: normal_test is not done */
#define VNDR_SHIFT_MBIST_NRML_FAIL                   2
#define VNDR_BIT_MBIST_NRML_FAIL                     ((u32)0x00000001 << 2)                              /*!<R 0x0  indicate whether the normal test fail 1: normal_test fail 0: normal_test not fail */
#define VNDR_SHIFT_MBIST_DRF_DONE                    1
#define VNDR_BIT_MBIST_DRF_DONE                      ((u32)0x00000001 << 1)                              /*!<R 0x1  indicate whether the drf_mbist test is done 1: drf_mbist test is done 0: drf_mbist test is not done */
#define VNDR_SHIFT_MBIST_DRF_FAIL                    0
#define VNDR_BIT_MBIST_DRF_FAIL                      ((u32)0x00000001 << 0)                              /*!<R 0x0  indicate whether the drf_mbist test fail 1: drf_mbist test fail 0: drf_mbist test not fail */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_DONE_RAM_0
 * @brief                                            (@ 0X0C8)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_DONE_ACBB2_ITLV_A                 31
#define VNDR_BIT_DONE_ACBB2_ITLV_A                   ((u32)0x00000001 << 31)                             /*!<R 0x0  mbist_acbb2_itlv_a 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_SOML_STBC              30
#define VNDR_BIT_DONE_ACBB2_SOML_STBC                ((u32)0x00000001 << 30)                             /*!<R 0x0  mbist_acbb2_soml_stbc 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_PTCSI                  29
#define VNDR_BIT_DONE_ACBB2_PTCSI                    ((u32)0x00000001 << 29)                             /*!<R 0x0  mbist_acbb2_ptcsi 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_FFT_NOISE_POWER        28
#define VNDR_BIT_DONE_ACBB2_FFT_NOISE_POWER          ((u32)0x00000001 << 28)                             /*!<R 0x0  mbist_acbb2_fft_noise_power 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_HWIGI_TXINFO_TABLE     27
#define VNDR_BIT_DONE_ACBB2_HWIGI_TXINFO_TABLE       ((u32)0x00000001 << 27)                             /*!<R 0x0  mbist_acbb2_hwigi_txinfo_table 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_MF_2ND20               26
#define VNDR_BIT_DONE_ACBB2_MF_2ND20                 ((u32)0x00000001 << 26)                             /*!<R 0x0  mbist_acbb2_mf_2nd20 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_MF_DELAY               25
#define VNDR_BIT_DONE_ACBB2_MF_DELAY                 ((u32)0x00000001 << 25)                             /*!<R 0x0  mbist_acbb2_mf_delay 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_SHARE_DELAY_SND        24
#define VNDR_BIT_DONE_ACBB2_SHARE_DELAY_SND          ((u32)0x00000001 << 24)                             /*!<R 0x0  mbist_acbb2_share_delay_snd 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_SHARE_DELAY_PRI        23
#define VNDR_BIT_DONE_ACBB2_SHARE_DELAY_PRI          ((u32)0x00000001 << 23)                             /*!<R 0x0  mbist_acbb2_share_delay_pri 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_SBD                    22
#define VNDR_BIT_DONE_ACBB2_SBD                      ((u32)0x00000001 << 22)                             /*!<R 0x0  mbist_acbb2_sbd 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_SBD_GI                 21
#define VNDR_BIT_DONE_ACBB2_SBD_GI                   ((u32)0x00000001 << 21)                             /*!<R 0x0  mbist_acbb2_sbd_GI 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_DFS_PWDB_FIFO          20
#define VNDR_BIT_DONE_ACBB2_DFS_PWDB_FIFO            ((u32)0x00000001 << 20)                             /*!<R 0x0  mbist_acbb2_dfs_pwdb_fifo 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_DFS_FFT_FIFO           19
#define VNDR_BIT_DONE_ACBB2_DFS_FFT_FIFO             ((u32)0x00000001 << 19)                             /*!<R 0x0  mbist_acbb2_dfs_fft_fifo 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_RPT_KEEPER             18
#define VNDR_BIT_DONE_ACBB2_RPT_KEEPER               ((u32)0x00000001 << 18)                             /*!<R 0x0  mbist_acbb2_rpt_keeper 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_ANAPAR                 17
#define VNDR_BIT_DONE_ACBB2_ANAPAR                   ((u32)0x00000001 << 17)                             /*!<R 0x0  mbist_acbb2_anapar 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_RXAGC                  16
#define VNDR_BIT_DONE_ACBB2_RXAGC                    ((u32)0x00000001 << 16)                             /*!<R 0x0  mbist_acbb2_rxagc 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_AXI_TXDMA              15
#define VNDR_BIT_DONE_WLMAC_AXI_TXDMA                ((u32)0x00000001 << 15)                             /*!<R 0x0  mbist_wlmac_axi_txdma 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMCU_IRAM                   14
#define VNDR_BIT_DONE_WLMCU_IRAM                     ((u32)0x00000001 << 14)                             /*!<R 0x0  mbist_wlmcu_iram 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMCU_ERAM1                  13
#define VNDR_BIT_DONE_WLMCU_ERAM1                    ((u32)0x00000001 << 13)                             /*!<R 0x0  mbist_wlmcu_eram1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMCU_ERAM0                  12
#define VNDR_BIT_DONE_WLMCU_ERAM0                    ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_wlmcu_eram0 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMCU_DRAM                   11
#define VNDR_BIT_DONE_WLMCU_DRAM                     ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_wlmcu_dram 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_TXRPTBUFFER            10
#define VNDR_BIT_DONE_WLMAC_TXRPTBUFFER              ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_wlmac_txrptbuffer 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_RXPKTBUFFER            9
#define VNDR_BIT_DONE_WLMAC_RXPKTBUFFER              ((u32)0x00000001 << 9)                              /*!<R 0x0  mbist_wlmac_rxpktbuffer 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_TXPKTBUFFER1           8
#define VNDR_BIT_DONE_WLMAC_TXPKTBUFFER1             ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_wlmac_txpktbuffer1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_TXPKTBUFFER0           7
#define VNDR_BIT_DONE_WLMAC_TXPKTBUFFER0             ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_wlmac_txpktbuffer0 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_TXLLT                  6
#define VNDR_BIT_DONE_WLMAC_TXLLT                    ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_wlmac_txllt 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_MACTX_FIFO             5
#define VNDR_BIT_DONE_WLMAC_MACTX_FIFO               ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_wlmac_mactx_fifo 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_MACRX_FIFO             4
#define VNDR_BIT_DONE_WLMAC_MACRX_FIFO               ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_wlmac_macrx_fifo 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_TKIPRC4                3
#define VNDR_BIT_DONE_WLMAC_TKIPRC4                  ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_wlmac_tkiprc4 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_PSF                    2
#define VNDR_BIT_DONE_WLMAC_PSF                      ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_wlmac_psf 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_RXBACAM                1
#define VNDR_BIT_DONE_WLMAC_RXBACAM                  ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_wlmac_rxbacam 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMAC_KEYSRCH                0
#define VNDR_BIT_DONE_WLMAC_KEYSRCH                  ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_wlmac_keysrch 1: bist done for this mbist group 0: bist not done */
/** @} */

