Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vndr_type.h
/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_DONE_RAM_1
 * @brief                                            (@ 0X0CC)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_DONE_BT_04                        31
#define VNDR_BIT_DONE_BT_04                          ((u32)0x00000001 << 31)                             /*!<R 0x0  mbist_bt_04 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_BT_03                        30
#define VNDR_BIT_DONE_BT_03                          ((u32)0x00000001 << 30)                             /*!<R 0x0  mbist_bt_03 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_BT_02                        29
#define VNDR_BIT_DONE_BT_02                          ((u32)0x00000001 << 29)                             /*!<R 0x0  mbist_bt_02 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_RESERVED15                        28
#define VNDR_BIT_RESERVED15                          ((u32)0x00000001 << 28)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED16                        27
#define VNDR_BIT_RESERVED16                          ((u32)0x00000001 << 27)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED17                        26
#define VNDR_BIT_RESERVED17                          ((u32)0x00000001 << 26)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED18                        25
#define VNDR_BIT_RESERVED18                          ((u32)0x00000001 << 25)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED19                        24
#define VNDR_BIT_RESERVED19                          ((u32)0x00000001 << 24)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED20                        23
#define VNDR_BIT_RESERVED20                          ((u32)0x00000001 << 23)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED21                        22
#define VNDR_BIT_RESERVED21                          ((u32)0x00000001 << 22)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED22                        21
#define VNDR_BIT_RESERVED22                          ((u32)0x00000001 << 21)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_DONE_ACBB2_CCK_CCA                20
#define VNDR_BIT_DONE_ACBB2_CCK_CCA                  ((u32)0x00000001 << 20)                             /*!<R 0x0  mbist_acbb2_cck_cca 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_TMETER                 19
#define VNDR_BIT_DONE_ACBB2_TMETER                   ((u32)0x00000001 << 19)                             /*!<R 0x0  mbist_acbb2_Tmeter 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_PWSF                   18
#define VNDR_BIT_DONE_ACBB2_PWSF                     ((u32)0x00000001 << 18)                             /*!<R 0x0  mbist_acbb2_pwsf 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_IQK_DPD                17
#define VNDR_BIT_DONE_ACBB2_IQK_DPD                  ((u32)0x00000001 << 17)                             /*!<R 0x0  mbist_acbb2_iqk_dpd 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_SYNC                   16
#define VNDR_BIT_DONE_ACBB2_SYNC                     ((u32)0x00000001 << 16)                             /*!<R 0x0  mbist_acbb2_sync 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_NCTL                   15
#define VNDR_BIT_DONE_ACBB2_NCTL                     ((u32)0x00000001 << 15)                             /*!<R 0x0  mbist_acbb2_nctl 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_VITERBI                14
#define VNDR_BIT_DONE_ACBB2_VITERBI                  ((u32)0x00000001 << 14)                             /*!<R 0x0  mbist_acbb2_viterbi 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_BFEE                   13
#define VNDR_BIT_DONE_ACBB2_BFEE                     ((u32)0x00000001 << 13)                             /*!<R 0x0  mbist_acbb2_Bfee 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_SHARE_FEQ_IN_DELAY     12
#define VNDR_BIT_DONE_ACBB2_SHARE_FEQ_IN_DELAY       ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_acbb2_share_feq_in_delay 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_SHARE_FEQ_IN_T0        11
#define VNDR_BIT_DONE_ACBB2_SHARE_FEQ_IN_T0          ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_acbb2_share_feq_in_t0 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_H_STS_PATH1            10
#define VNDR_BIT_DONE_ACBB2_H_STS_PATH1              ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_acbb2_H_sts_path1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_H_STS_PATH0            9
#define VNDR_BIT_DONE_ACBB2_H_STS_PATH0              ((u32)0x00000001 << 9)                              /*!<R 0x0  mbist_acbb2_H_sts_path0 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_PRECCA_POWCAL          8
#define VNDR_BIT_DONE_ACBB2_PRECCA_POWCAL            ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_acbb2_precca_powcal 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_NOISE_POW              7
#define VNDR_BIT_DONE_ACBB2_NOISE_POW                ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_acbb2_noise_pow 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_PILOT_TRACKING         6
#define VNDR_BIT_DONE_ACBB2_PILOT_TRACKING           ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_acbb2_pilot_tracking 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_FOE_LLTF               5
#define VNDR_BIT_DONE_ACBB2_FOE_LLTF                 ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_acbb2_foe_lltf 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_GI_BUFF                4
#define VNDR_BIT_DONE_ACBB2_GI_BUFF                  ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_acbb2_gi_buff 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_DLY_512                3
#define VNDR_BIT_DONE_ACBB2_DLY_512                  ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_acbb2_dly_512 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_FFTBUF                 2
#define VNDR_BIT_DONE_ACBB2_FFTBUF                   ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_acbb2_fftbuf 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_FFT                    1
#define VNDR_BIT_DONE_ACBB2_FFT                      ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_acbb2_fft 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ACBB2_ITLV_B                 0
#define VNDR_BIT_DONE_ACBB2_ITLV_B                   ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_acbb2_itlv_b 1: bist done for this mbist group 0: bist not done */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_DONE_RAM_2
 * @brief                                            (@ 0X0D0)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_DONE_VOE_FBCU_OBUF_BUF1           31
#define VNDR_BIT_DONE_VOE_FBCU_OBUF_BUF1             ((u32)0x00000001 << 31)                             /*!<R 0x0  mbist_voe_fbcu_obuf_buf1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_VOE_FBCU_OBUF_BUF0           30
#define VNDR_BIT_DONE_VOE_FBCU_OBUF_BUF0             ((u32)0x00000001 << 30)                             /*!<R 0x0  mbist_voe_fbcu_obuf_buf0 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_VOE_SHARED_SRAM              29
#define VNDR_BIT_DONE_VOE_SHARED_SRAM                ((u32)0x00000001 << 29)                             /*!<R 0x0  mbist_voe_shared_sram 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_VOEMCU_DTCM                  28
#define VNDR_BIT_DONE_VOEMCU_DTCM                    ((u32)0x00000001 << 28)                             /*!<R 0x0  mbist_voemcu_dtcm 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_VOEMCU_ITCM_RAM              27
#define VNDR_BIT_DONE_VOEMCU_ITCM_RAM                ((u32)0x00000001 << 27)                             /*!<R 0x0  mbist_voemcu_itcm_ram 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_CPU_ITCM_RAM                 26
#define VNDR_BIT_DONE_CPU_ITCM_RAM                   ((u32)0x00000001 << 26)                             /*!<R 0x0  mbist_cpu_itcm_ram 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_CPU_PHT_BTB                  25
#define VNDR_BIT_DONE_CPU_PHT_BTB                    ((u32)0x00000001 << 25)                             /*!<R 0x0  mbist_cpu_pht_btb 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_CPU_IC                       24
#define VNDR_BIT_DONE_CPU_IC                         ((u32)0x00000001 << 24)                             /*!<R 0x0  mbist_cpu_ic 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_CPU_DC                       23
#define VNDR_BIT_DONE_CPU_DC                         ((u32)0x00000001 << 23)                             /*!<R 0x0  mbist_cpu_dc 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_CPU_DTCM_RAM                 22
#define VNDR_BIT_DONE_CPU_DTCM_RAM                   ((u32)0x00000001 << 22)                             /*!<R 0x0  mbist_cpu_dtcm_ram 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_SDMMC_PPBECC                 21
#define VNDR_BIT_DONE_SDMMC_PPBECC                   ((u32)0x00000001 << 21)                             /*!<R 0x0  mbist_sdmmc_ppbecc 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_SDMMC_DMASB1                 20
#define VNDR_BIT_DONE_SDMMC_DMASB1                   ((u32)0x00000001 << 20)                             /*!<R 0x0  mbist_sdmmc_dmasb1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_USBOTG                       19
#define VNDR_BIT_DONE_USBOTG                         ((u32)0x00000001 << 19)                             /*!<R 0x0  mbist_usbotg 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_SDIO                         18
#define VNDR_BIT_DONE_SDIO                           ((u32)0x00000001 << 18)                             /*!<R 0x0  mbist_sdio 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_MIPI                         17
#define VNDR_BIT_DONE_MIPI                           ((u32)0x00000001 << 17)                             /*!<R 0x0  mbist_mipi 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_OSDBRIDGE                    16
#define VNDR_BIT_DONE_OSDBRIDGE                      ((u32)0x00000001 << 16)                             /*!<R 0x0  mbist_osdbridge 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_OSDPAINTER                   15
#define VNDR_BIT_DONE_OSDPAINTER                     ((u32)0x00000001 << 15)                             /*!<R 0x0  mbist_osdpainter 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_VIDEO_AMBA                   14
#define VNDR_BIT_DONE_VIDEO_AMBA                     ((u32)0x00000001 << 14)                             /*!<R 0x0  mbist_video_amba 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ISP_DMA3                     13
#define VNDR_BIT_DONE_ISP_DMA3                       ((u32)0x00000001 << 13)                             /*!<R 0x0  mbist_isp_dma3 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ISPH_VHDR_ADD                12
#define VNDR_BIT_DONE_ISPH_VHDR_ADD                  ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_isph VHDR add 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ISPG                         11
#define VNDR_BIT_DONE_ISPG                           ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_ispg 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ISPF                         10
#define VNDR_BIT_DONE_ISPF                           ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_ispf 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ISPE                         9
#define VNDR_BIT_DONE_ISPE                           ((u32)0x00000001 << 9)                              /*!<R 0x0  mbist_ispe 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ISPD                         8
#define VNDR_BIT_DONE_ISPD                           ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_ispd 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ISPC                         7
#define VNDR_BIT_DONE_ISPC                           ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_ispc 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ISPB                         6
#define VNDR_BIT_DONE_ISPB                           ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_ispb 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ISPA                         5
#define VNDR_BIT_DONE_ISPA                           ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_ispa 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_GMAC_SRAM                    4
#define VNDR_BIT_DONE_GMAC_SRAM                      ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_gmac_sram 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_BT_CPU                       3
#define VNDR_BIT_DONE_BT_CPU                         ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_bt_cpu 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_BT_07                        2
#define VNDR_BIT_DONE_BT_07                          ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_bt_07 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_BT_06                        1
#define VNDR_BIT_DONE_BT_06                          ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_bt_06 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_BT_05                        0
#define VNDR_BIT_DONE_BT_05                          ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_bt_05 1: bist done for this mbist group 0: bist not done */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_DONE_RAM_3
 * @brief                                            (@ 0X0D4)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_DONE_ENC_GROUP05_1                31
#define VNDR_BIT_DONE_ENC_GROUP05_1                  ((u32)0x00000001 << 31)                             /*!<R 0x0  mbist_enc_group05_1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP04                  30
#define VNDR_BIT_DONE_ENC_GROUP04                    ((u32)0x00000001 << 30)                             /*!<R 0x0  mbist_enc_group04 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP03_2                29
#define VNDR_BIT_DONE_ENC_GROUP03_2                  ((u32)0x00000001 << 29)                             /*!<R 0x0  mbist_enc_group03_2 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP03_1                28
#define VNDR_BIT_DONE_ENC_GROUP03_1                  ((u32)0x00000001 << 28)                             /*!<R 0x0  mbist_enc_group03_1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP02                  27
#define VNDR_BIT_DONE_ENC_GROUP02                    ((u32)0x00000001 << 27)                             /*!<R 0x0  mbist_enc_group02 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP01                  26
#define VNDR_BIT_DONE_ENC_GROUP01                    ((u32)0x00000001 << 26)                             /*!<R 0x0  mbist_enc_group01 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_RXI316_1P                    25
#define VNDR_BIT_DONE_RXI316_1P                      ((u32)0x00000001 << 25)                             /*!<R 0x0  mbist_rxi316_1p 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_RXI316_2P                    24
#define VNDR_BIT_DONE_RXI316_2P                      ((u32)0x00000001 << 24)                             /*!<R 0x0  mbist_rxi316_2p 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_PLATFORM_GRP                 23
#define VNDR_BIT_DONE_PLATFORM_GRP                   ((u32)0x00000001 << 23)                             /*!<R 0x0  mbist_platform_grp 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_SHARE_MEM_BT                 22
#define VNDR_BIT_DONE_SHARE_MEM_BT                   ((u32)0x00000001 << 22)                             /*!<R 0x0  mbist_share_mem_bt 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_ACLK                      21
#define VNDR_BIT_DONE_NN_ACLK                        ((u32)0x00000001 << 21)                             /*!<R 0x0  mbist_nn_ACLK 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKSH_DIV2                20
#define VNDR_BIT_DONE_NN_CLKSH_DIV2                  ((u32)0x00000001 << 20)                             /*!<R 0x0  mbist_nn_clkSh_div2 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G17               19
#define VNDR_BIT_DONE_NN_CLKCORE_G17                 ((u32)0x00000001 << 19)                             /*!<R 0x0  mbist_nn_clkCore_g17 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G16               18
#define VNDR_BIT_DONE_NN_CLKCORE_G16                 ((u32)0x00000001 << 18)                             /*!<R 0x0  mbist_nn_clkCore_g16 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G15               17
#define VNDR_BIT_DONE_NN_CLKCORE_G15                 ((u32)0x00000001 << 17)                             /*!<R 0x0  mbist_nn_clkCore_g15 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G14               16
#define VNDR_BIT_DONE_NN_CLKCORE_G14                 ((u32)0x00000001 << 16)                             /*!<R 0x0  mbist_nn_clkCore_g14 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G13               15
#define VNDR_BIT_DONE_NN_CLKCORE_G13                 ((u32)0x00000001 << 15)                             /*!<R 0x0  mbist_nn_clkCore_g13 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G12               14
#define VNDR_BIT_DONE_NN_CLKCORE_G12                 ((u32)0x00000001 << 14)                             /*!<R 0x0  mbist_nn_clkCore_g12 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G11               13
#define VNDR_BIT_DONE_NN_CLKCORE_G11                 ((u32)0x00000001 << 13)                             /*!<R 0x0  mbist_nn_clkCore_g11 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G10               12
#define VNDR_BIT_DONE_NN_CLKCORE_G10                 ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_nn_clkCore_g10 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G9                11
#define VNDR_BIT_DONE_NN_CLKCORE_G9                  ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_nn_clkCore_g9 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G8                10
#define VNDR_BIT_DONE_NN_CLKCORE_G8                  ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_nn_clkCore_g8 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G7                9
#define VNDR_BIT_DONE_NN_CLKCORE_G7                  ((u32)0x00000001 << 9)                              /*!<R 0x0  mbist_nn_clkCore_g7 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G6                8
#define VNDR_BIT_DONE_NN_CLKCORE_G6                  ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_nn_clkCore_g6 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G5                7
#define VNDR_BIT_DONE_NN_CLKCORE_G5                  ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_nn_clkCore_g5 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G4                6
#define VNDR_BIT_DONE_NN_CLKCORE_G4                  ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_nn_clkCore_g4 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G3                5
#define VNDR_BIT_DONE_NN_CLKCORE_G3                  ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_nn_clkCore_g3 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G2                4
#define VNDR_BIT_DONE_NN_CLKCORE_G2                  ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_nn_clkCore_g2 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G1                3
#define VNDR_BIT_DONE_NN_CLKCORE_G1                  ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_nn_clkCore_g1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_NN_CLKCORE_G0                2
#define VNDR_BIT_DONE_NN_CLKCORE_G0                  ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_nn_clkCore_g0 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_VOE_CPU_DCACHE               1
#define VNDR_BIT_DONE_VOE_CPU_DCACHE                 ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_voe_cpu_dcache 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_VOE_CPU_ICACHE               0
#define VNDR_BIT_DONE_VOE_CPU_ICACHE                 ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_voe_cpu_icache 1: bist done for this mbist group 0: bist not done */
/** @} */

