Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vndr_type.h
/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_DONE_RAM_4
 * @brief                                            (@ 0X0D8)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED23                        16
#define VNDR_MASK_RESERVED23                         ((u32)0x0000FFFF << 16)                             /*!<R 0x0   */
#define VNDR_SHIFT_DONE_BSTC_HWPAT                   15
#define VNDR_BIT_DONE_BSTC_HWPAT                     ((u32)0x00000001 << 15)                             /*!<R 0x0  mbist_BSTC_HWPAT 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_RSA                          14
#define VNDR_BIT_DONE_RSA                            ((u32)0x00000001 << 14)                             /*!<R 0x0  mbist_RSA 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP14                  13
#define VNDR_BIT_DONE_ENC_GROUP14                    ((u32)0x00000001 << 13)                             /*!<R 0x0  mbist_enc_group14 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP13_2                12
#define VNDR_BIT_DONE_ENC_GROUP13_2                  ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_enc_group13_2 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP13_1                11
#define VNDR_BIT_DONE_ENC_GROUP13_1                  ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_enc_group13_1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP12_2                10
#define VNDR_BIT_DONE_ENC_GROUP12_2                  ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_enc_group12_2 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP12_1                9
#define VNDR_BIT_DONE_ENC_GROUP12_1                  ((u32)0x00000001 << 9)                              /*!<R 0x0  mbist_enc_group12_1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP11_2                8
#define VNDR_BIT_DONE_ENC_GROUP11_2                  ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_enc_group11_2 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP11_1                7
#define VNDR_BIT_DONE_ENC_GROUP11_1                  ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_enc_group11_1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP10_2                6
#define VNDR_BIT_DONE_ENC_GROUP10_2                  ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_enc_group10_2 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP10_1                5
#define VNDR_BIT_DONE_ENC_GROUP10_1                  ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_enc_group10_1 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP09                  4
#define VNDR_BIT_DONE_ENC_GROUP09                    ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_enc_group09 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP08                  3
#define VNDR_BIT_DONE_ENC_GROUP08                    ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_enc_group08 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP07                  2
#define VNDR_BIT_DONE_ENC_GROUP07                    ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_enc_group07 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP06                  1
#define VNDR_BIT_DONE_ENC_GROUP06                    ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_enc_group06 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_ENC_GROUP05_2                0
#define VNDR_BIT_DONE_ENC_GROUP05_2                  ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_enc_group05_2 1: bist done for this mbist group 0: bist not done */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_DONE_ROM
 * @brief                                            (@ 0X0DC)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED24                        7
#define VNDR_MASK_RESERVED24                         ((u32)0x01FFFFFF << 7)                              /*!<R 0x0   */
#define VNDR_SHIFT_DONE_PLATFORM_ROM_GRP             6
#define VNDR_BIT_DONE_PLATFORM_ROM_GRP               ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_platform_rom_grp 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_VOEMCU_ITCM_ROM              5
#define VNDR_BIT_DONE_VOEMCU_ITCM_ROM                ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_voemcu_itcm_rom 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_VOEMCU_DTCM_ROM              4
#define VNDR_BIT_DONE_VOEMCU_DTCM_ROM                ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_voemcu_dtcm_rom 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_CPU_ITCM_ROM                 3
#define VNDR_BIT_DONE_CPU_ITCM_ROM                   ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_cpu_itcm_rom 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_CPU_DTCM_ROM                 2
#define VNDR_BIT_DONE_CPU_DTCM_ROM                   ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_cpu_dtcm_rom 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_BT_01                        1
#define VNDR_BIT_DONE_BT_01                          ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_bt_01 1: bist done for this mbist group 0: bist not done */
#define VNDR_SHIFT_DONE_WLMCU_IROM                   0
#define VNDR_BIT_DONE_WLMCU_IROM                     ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_wlmcu_irom 1: bist done for this mbist group 0: bist not done */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_0
 * @brief                                            (@ 0X0E0)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED25                        30
#define VNDR_MASK_RESERVED25                         ((u32)0x00000003 << 30)                             /*!<-- --   */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_MF_DELAY          29
#define VNDR_MASK_NRML_FAIL_ACBB2_MF_DELAY           ((u32)0x00000003 << 29)                             /*!<R 0x0  mbist_acbb2_mf_delay 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_SHARE_DELAY_SND   27
#define VNDR_MASK_NRML_FAIL_ACBB2_SHARE_DELAY_SND    ((u32)0x00000003 << 27)                             /*!<R 0x0  mbist_acbb2_share_delay_snd 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_SHARE_DELAY_PRI   25
#define VNDR_MASK_NRML_FAIL_ACBB2_SHARE_DELAY_PRI    ((u32)0x00000003 << 25)                             /*!<R 0x0  mbist_acbb2_share_delay_pri 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_SBD               24
#define VNDR_BIT_NRML_FAIL_ACBB2_SBD                 ((u32)0x00000001 << 24)                             /*!<R 0x0  mbist_acbb2_sbd 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_SBD_GI            23
#define VNDR_BIT_NRML_FAIL_ACBB2_SBD_GI              ((u32)0x00000001 << 23)                             /*!<R 0x0  mbist_acbb2_sbd_GI 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_DFS_PWDB_FIFO     22
#define VNDR_BIT_NRML_FAIL_ACBB2_DFS_PWDB_FIFO       ((u32)0x00000001 << 22)                             /*!<R 0x0  mbist_acbb2_dfs_pwdb_fifo 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_DFS_FFT_FIFO      19
#define VNDR_MASK_NRML_FAIL_ACBB2_DFS_FFT_FIFO       ((u32)0x00000007 << 19)                             /*!<R 0x0  mbist_acbb2_dfs_fft_fifo 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_RPT_KEEPER        18
#define VNDR_BIT_NRML_FAIL_ACBB2_RPT_KEEPER          ((u32)0x00000001 << 18)                             /*!<R 0x0  mbist_acbb2_rpt_keeper 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_ANAPAR            17
#define VNDR_BIT_NRML_FAIL_ACBB2_ANAPAR              ((u32)0x00000001 << 17)                             /*!<R 0x0  mbist_acbb2_anapar 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_RXAGC             16
#define VNDR_BIT_NRML_FAIL_ACBB2_RXAGC               ((u32)0x00000001 << 16)                             /*!<R 0x0  mbist_acbb2_rxagc 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_AXI_TXDMA         15
#define VNDR_BIT_NRML_FAIL_WLMAC_AXI_TXDMA           ((u32)0x00000001 << 15)                             /*!<R 0x0  mbist_wlmac_axi_txdma 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMCU_IRAM              14
#define VNDR_BIT_NRML_FAIL_WLMCU_IRAM                ((u32)0x00000001 << 14)                             /*!<R 0x0  mbist_wlmcu_iram 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMCU_ERAM1             13
#define VNDR_BIT_NRML_FAIL_WLMCU_ERAM1               ((u32)0x00000001 << 13)                             /*!<R 0x0  mbist_wlmcu_eram1 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMCU_ERAM0             12
#define VNDR_BIT_NRML_FAIL_WLMCU_ERAM0               ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_wlmcu_eram0 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMCU_DRAM              11
#define VNDR_BIT_NRML_FAIL_WLMCU_DRAM                ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_wlmcu_dram 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_TXRPTBUFFER       10
#define VNDR_BIT_NRML_FAIL_WLMAC_TXRPTBUFFER         ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_wlmac_txrptbuffer 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_RXPKTBUFFER       9
#define VNDR_BIT_NRML_FAIL_WLMAC_RXPKTBUFFER         ((u32)0x00000001 << 9)                              /*!<R 0x0  mbist_wlmac_rxpktbuffer 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_TXPKTBUFFER1      8
#define VNDR_BIT_NRML_FAIL_WLMAC_TXPKTBUFFER1        ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_wlmac_txpktbuffer1 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_TXPKTBUFFER0      7
#define VNDR_BIT_NRML_FAIL_WLMAC_TXPKTBUFFER0        ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_wlmac_txpktbuffer0 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_TXLLT             6
#define VNDR_BIT_NRML_FAIL_WLMAC_TXLLT               ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_wlmac_txllt 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_MACTX_FIFO        5
#define VNDR_BIT_NRML_FAIL_WLMAC_MACTX_FIFO          ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_wlmac_mactx_fifo 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_MACRX_FIFO        4
#define VNDR_BIT_NRML_FAIL_WLMAC_MACRX_FIFO          ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_wlmac_macrx_fifo 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_TKIPRC4           3
#define VNDR_BIT_NRML_FAIL_WLMAC_TKIPRC4             ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_wlmac_tkiprc4 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_PSF               2
#define VNDR_BIT_NRML_FAIL_WLMAC_PSF                 ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_wlmac_psf 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_RXBACAM           1
#define VNDR_BIT_NRML_FAIL_WLMAC_RXBACAM             ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_wlmac_rxbacam 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_WLMAC_KEYSRCH           0
#define VNDR_BIT_NRML_FAIL_WLMAC_KEYSRCH             ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_wlmac_keysrch 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_1
 * @brief                                            (@ 0X0E4)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_NRML_FAIL_ACBB2_SHARE_FEQ_IN_T0   31
#define VNDR_BIT_NRML_FAIL_ACBB2_SHARE_FEQ_IN_T0     ((u32)0x00000001 << 31)                             /*!<R 0x0  mbist_acbb2_share_feq_in_t0 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_H_STS_PATH1       30
#define VNDR_BIT_NRML_FAIL_ACBB2_H_STS_PATH1         ((u32)0x00000001 << 30)                             /*!<R 0x0  mbist_acbb2_H_sts_path1 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_H_STS_PATH0       29
#define VNDR_BIT_NRML_FAIL_ACBB2_H_STS_PATH0         ((u32)0x00000001 << 29)                             /*!<R 0x0  mbist_acbb2_H_sts_path0 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_PRECCA_POWCAL     28
#define VNDR_BIT_NRML_FAIL_ACBB2_PRECCA_POWCAL       ((u32)0x00000001 << 28)                             /*!<R 0x0  mbist_acbb2_precca_powcal 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_NOISE_POW         27
#define VNDR_BIT_NRML_FAIL_ACBB2_NOISE_POW           ((u32)0x00000001 << 27)                             /*!<R 0x0  mbist_acbb2_noise_pow 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_PILOT_TRACKING    25
#define VNDR_MASK_NRML_FAIL_ACBB2_PILOT_TRACKING     ((u32)0x00000003 << 25)                             /*!<R 0x0  mbist_acbb2_pilot_tracking 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_FOE_LLTF          24
#define VNDR_BIT_NRML_FAIL_ACBB2_FOE_LLTF            ((u32)0x00000001 << 24)                             /*!<R 0x0  mbist_acbb2_foe_lltf 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_GI_BUFF           23
#define VNDR_BIT_NRML_FAIL_ACBB2_GI_BUFF             ((u32)0x00000001 << 23)                             /*!<R 0x0  mbist_acbb2_gi_buff 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_DLY_512           21
#define VNDR_MASK_NRML_FAIL_ACBB2_DLY_512            ((u32)0x00000003 << 21)                             /*!<R 0x0  mbist_acbb2_dly_512 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_FFTBUF            19
#define VNDR_MASK_NRML_FAIL_ACBB2_FFTBUF             ((u32)0x00000003 << 19)                             /*!<R 0x0  mbist_acbb2_fftbuf 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_FFT               16
#define VNDR_MASK_NRML_FAIL_ACBB2_FFT                ((u32)0x00000007 << 16)                             /*!<R 0x0  mbist_acbb2_fft 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_ITLV_B            12
#define VNDR_MASK_NRML_FAIL_ACBB2_ITLV_B             ((u32)0x0000000F << 12)                             /*!<R 0x0  mbist_acbb2_itlv_b 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_ITLV_A            8
#define VNDR_MASK_NRML_FAIL_ACBB2_ITLV_A             ((u32)0x0000000F << 8)                              /*!<R 0x0  mbist_acbb2_itlv_a 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_SOML_STBC         7
#define VNDR_BIT_NRML_FAIL_ACBB2_SOML_STBC           ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_acbb2_soml_stbc 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_PTCSI             6
#define VNDR_BIT_NRML_FAIL_ACBB2_PTCSI               ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_acbb2_ptcsi 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_FFT_NOISE_POWER   3
#define VNDR_MASK_NRML_FAIL_ACBB2_FFT_NOISE_POWER    ((u32)0x00000007 << 3)                              /*!<R 0x0  mbist_acbb2_fft_noise_power 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_HWIGI_TXINFO_TABLE2
#define VNDR_BIT_NRML_FAIL_ACBB2_HWIGI_TXINFO_TABLE  ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_acbb2_hwigi_txinfo_table 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_MF_2ND20          0
#define VNDR_MASK_NRML_FAIL_ACBB2_MF_2ND20           ((u32)0x00000003 << 0)                              /*!<R 0x0  mbist_acbb2_mf_2nd20 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_2
 * @brief                                            (@ 0X0E8)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED26                        16
#define VNDR_MASK_RESERVED26                         ((u32)0x0000FFFF << 16)                             /*!<R --   */
#define VNDR_SHIFT_NRML_FAIL_MBIST_ACBB2_CCK_CCA     13
#define VNDR_MASK_NRML_FAIL_MBIST_ACBB2_CCK_CCA      ((u32)0x00000007 << 13)                             /*!<R 0x0  mbist_mbist_acbb2_cck_cca 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_TMETER            12
#define VNDR_BIT_NRML_FAIL_ACBB2_TMETER              ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_acbb2_Tmeter 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_PWSF              11
#define VNDR_BIT_NRML_FAIL_ACBB2_PWSF                ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_acbb2_pwsf 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_IQK_DPD           9
#define VNDR_MASK_NRML_FAIL_ACBB2_IQK_DPD            ((u32)0x00000003 << 9)                              /*!<R 0x0  mbist_acbb2_iqk_dpd 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_SYNC              8
#define VNDR_BIT_NRML_FAIL_ACBB2_SYNC                ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_acbb2_sync 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_NCTL              7
#define VNDR_BIT_NRML_FAIL_ACBB2_NCTL                ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_acbb2_nctl 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_VITERBI           3
#define VNDR_MASK_NRML_FAIL_ACBB2_VITERBI            ((u32)0x0000000F << 3)                              /*!<R 0x0  mbist_acbb2_viterbi 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_BFEE              1
#define VNDR_MASK_NRML_FAIL_ACBB2_BFEE               ((u32)0x00000003 << 1)                              /*!<R 0x0  mbist_acbb2_Bfee 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ACBB2_SHARE_FEQ_IN_DELAY0
#define VNDR_BIT_NRML_FAIL_ACBB2_SHARE_FEQ_IN_DELAY  ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_acbb2_share_feq_in_delay 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_3
 * @brief                                            (@ 0X0EC)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED27                        19
#define VNDR_MASK_RESERVED27                         ((u32)0x00001FFF << 19)                             /*!<R 0x0   */
#define VNDR_SHIFT_NRML_FAIL_GMAC_SRAM               17
#define VNDR_MASK_NRML_FAIL_GMAC_SRAM                ((u32)0x00000003 << 17)                             /*!<R 0x0  mbist_gmac_sram 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_BT_CPU                  13
#define VNDR_MASK_NRML_FAIL_BT_CPU                   ((u32)0x0000000F << 13)                             /*!<R 0x0  mbist_bt_cpu 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_BT_07                   12
#define VNDR_BIT_NRML_FAIL_BT_07                     ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_bt_07 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_BT_06                   11
#define VNDR_BIT_NRML_FAIL_BT_06                     ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_bt_06 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_BT_05                   10
#define VNDR_BIT_NRML_FAIL_BT_05                     ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_bt_05 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_BT_04                   6
#define VNDR_MASK_NRML_FAIL_BT_04                    ((u32)0x0000000F << 6)                              /*!<R 0x0  mbist_bt_04 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_BT_03                   1
#define VNDR_MASK_NRML_FAIL_BT_03                    ((u32)0x0000001F << 1)                              /*!<R 0x0  mbist_bt_03 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_BT_02                   0
#define VNDR_BIT_NRML_FAIL_BT_02                     ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_bt_02 1: memory normal test fail 0: memory normal test pass */
/** @} */

