Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vndr_type.h
/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_4
 * @brief                                            (@ 0X0F0)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED28                        24
#define VNDR_MASK_RESERVED28                         ((u32)0x000000FF << 24)                             /*!<R 0x0   */
#define VNDR_SHIFT_NRML_FAIL_ISPC                    18
#define VNDR_MASK_NRML_FAIL_ISPC                     ((u32)0x0000003F << 18)                             /*!<R 0x0  mbist_ispc 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ISPB                    9
#define VNDR_MASK_NRML_FAIL_ISPB                     ((u32)0x000001FF << 9)                              /*!<R 0x0  mbist_ispb 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ISPA                    0
#define VNDR_MASK_NRML_FAIL_ISPA                     ((u32)0x000001FF << 0)                              /*!<R 0x0  mbist_ispa 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_5
 * @brief                                            (@ 0X0F4)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED29                        29
#define VNDR_MASK_RESERVED29                         ((u32)0x00000007 << 29)                             /*!<R 0x0   */
#define VNDR_SHIFT_NRML_FAIL_ISPG                    25
#define VNDR_MASK_NRML_FAIL_ISPG                     ((u32)0x0000000F << 25)                             /*!<R 0x0  mbist_ispg 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ISPF                    17
#define VNDR_MASK_NRML_FAIL_ISPF                     ((u32)0x000000FF << 17)                             /*!<R 0x0  mbist_ispf 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ISPE                    9
#define VNDR_MASK_NRML_FAIL_ISPE                     ((u32)0x000000FF << 9)                              /*!<R 0x0  mbist_ispe 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ISPD                    0
#define VNDR_MASK_NRML_FAIL_ISPD                     ((u32)0x000001FF << 0)                              /*!<R 0x0  mbist_ispd 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_6
 * @brief                                            (@ 0X0F8)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_NRML_FAIL_MIPI                    24
#define VNDR_MASK_NRML_FAIL_MIPI                     ((u32)0x000000FF << 24)                             /*!<R 0x0  mbist_mipi 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_OSDBRIDGE               23
#define VNDR_BIT_NRML_FAIL_OSDBRIDGE                 ((u32)0x00000001 << 23)                             /*!<R 0x0  mbist_osdbridge 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_OSDPAINTER              18
#define VNDR_MASK_NRML_FAIL_OSDPAINTER               ((u32)0x0000001F << 18)                             /*!<R 0x0  mbist_osdpainter 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_VIDEO_AMBA              13
#define VNDR_MASK_NRML_FAIL_VIDEO_AMBA               ((u32)0x0000001F << 13)                             /*!<R 0x0  mbist_video_amba 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ISP_DMA3                10
#define VNDR_MASK_NRML_FAIL_ISP_DMA3                 ((u32)0x00000007 << 10)                             /*!<R 0x0  mbist_isp_dma3 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ISPHVHDR                0
#define VNDR_MASK_NRML_FAIL_ISPHVHDR                 ((u32)0x000003FF << 0)                              /*!<R 0x0  mbist_isphVHDR 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_7
 * @brief                                            (@ 0X0FC)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_NRML_FAIL_VOE_CPU_ICACHE          30
#define VNDR_MASK_NRML_FAIL_VOE_CPU_ICACHE           ((u32)0x00000003 << 30)                             /*!<R 0x0  mbist_voe_cpu_icache 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_VOE_FBCU_OBUF_BUF1      29
#define VNDR_BIT_NRML_FAIL_VOE_FBCU_OBUF_BUF1        ((u32)0x00000001 << 29)                             /*!<R 0x0  mbist_voe_fbcu_obuf_buf1 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_VOE_FBCU_OBUF_BUF0      28
#define VNDR_BIT_NRML_FAIL_VOE_FBCU_OBUF_BUF0        ((u32)0x00000001 << 28)                             /*!<R 0x0  mbist_voe_fbcu_obuf_buf0 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_VOE_SHARED_SRAM         27
#define VNDR_BIT_NRML_FAIL_VOE_SHARED_SRAM           ((u32)0x00000001 << 27)                             /*!<R 0x0  mbist_voe_shared_sram 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_VOEMCU_DTCM             26
#define VNDR_BIT_NRML_FAIL_VOEMCU_DTCM               ((u32)0x00000001 << 26)                             /*!<R 0x0  mbist_voemcu_dtcm 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_VOEMCU_ITCM_RAM         25
#define VNDR_BIT_NRML_FAIL_VOEMCU_ITCM_RAM           ((u32)0x00000001 << 25)                             /*!<R 0x0  mbist_voemcu_itcm_ram 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_CPU_ITCM_RAM            20
#define VNDR_MASK_NRML_FAIL_CPU_ITCM_RAM             ((u32)0x0000001F << 20)                             /*!<R 0x0  mbist_cpu_itcm_ram 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_CPU_PHT_BTB             17
#define VNDR_MASK_NRML_FAIL_CPU_PHT_BTB              ((u32)0x00000007 << 17)                             /*!<R 0x0  mbist_cpu_pht_btb 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_CPU_IC                  13
#define VNDR_MASK_NRML_FAIL_CPU_IC                   ((u32)0x0000000F << 13)                             /*!<R 0x0  mbist_cpu_ic 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_CPU_DC                  10
#define VNDR_MASK_NRML_FAIL_CPU_DC                   ((u32)0x00000007 << 10)                             /*!<R 0x0  mbist_cpu_dc 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_CPU_DTCM_RAM            6
#define VNDR_MASK_NRML_FAIL_CPU_DTCM_RAM             ((u32)0x0000000F << 6)                              /*!<R 0x0  mbist_cpu_dtcm_ram 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_SDMMC_PPBECC            4
#define VNDR_MASK_NRML_FAIL_SDMMC_PPBECC             ((u32)0x00000003 << 4)                              /*!<R 0x0  mbist_sdmmc_ppbecc 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_SDMMC_DMASB1            2
#define VNDR_MASK_NRML_FAIL_SDMMC_DMASB1             ((u32)0x00000003 << 2)                              /*!<R 0x0  mbist_sdmmc_dmasb1 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_USBOTG                  1
#define VNDR_BIT_NRML_FAIL_USBOTG                    ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_usbotg 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_SDIO                    0
#define VNDR_BIT_NRML_FAIL_SDIO                      ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_sdio 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_8
 * @brief                                            (@ 0X100)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED30                        29
#define VNDR_MASK_RESERVED30                         ((u32)0x00000007 << 29)                             /*!<R 0x0   */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G4           23
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G4            ((u32)0x0000003F << 23)                             /*!<R 0x0  mbist_nn_clkCore_g4 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G3           17
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G3            ((u32)0x0000003F << 17)                             /*!<R 0x0  mbist_nn_clkCore_g3 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G2           11
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G2            ((u32)0x0000003F << 11)                             /*!<R 0x0  mbist_nn_clkCore_g2 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G1           5
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G1            ((u32)0x0000003F << 5)                              /*!<R 0x0  mbist_nn_clkCore_g1 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G0           2
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G0            ((u32)0x00000007 << 2)                              /*!<R 0x0  mbist_nn_clkCore_g0 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_VOE_CPU_DCACHE          0
#define VNDR_MASK_NRML_FAIL_VOE_CPU_DCACHE           ((u32)0x00000003 << 0)                              /*!<R 0x0  mbist_voe_cpu_dcache 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_9
 * @brief                                            (@ 0X104)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED31                        25
#define VNDR_MASK_RESERVED31                         ((u32)0x0000007F << 25)                             /*!<R 0x0   */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G11          23
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G11           ((u32)0x00000003 << 23)                             /*!<R 0x0  mbist_nn_clkCore_g11 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G10          21
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G10           ((u32)0x00000003 << 21)                             /*!<R 0x0  mbist_nn_clkCore_g10 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G9           18
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G9            ((u32)0x00000007 << 18)                             /*!<R 0x0  mbist_nn_clkCore_g9 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G8           14
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G8            ((u32)0x0000000F << 14)                             /*!<R 0x0  mbist_nn_clkCore_g8 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G7           10
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G7            ((u32)0x0000000F << 10)                             /*!<R 0x0  mbist_nn_clkCore_g7 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G6           8
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G6            ((u32)0x00000003 << 8)                              /*!<R 0x0  mbist_nn_clkCore_g6 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G5           0
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G5            ((u32)0x000000FF << 0)                              /*!<R 0x0  mbist_nn_clkCore_g5 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_10
 * @brief                                            (@ 0X108)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED32                        28
#define VNDR_MASK_RESERVED32                         ((u32)0x0000000F << 28)                             /*!<R 0x0   */
#define VNDR_SHIFT_NRML_FAIL_NN_ACLK                 27
#define VNDR_BIT_NRML_FAIL_NN_ACLK                   ((u32)0x00000001 << 27)                             /*!<R 0x0  mbist_nn_ACLK 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKSH_DIV2           25
#define VNDR_MASK_NRML_FAIL_NN_CLKSH_DIV2            ((u32)0x00000003 << 25)                             /*!<R 0x0  mbist_nn_clkSh_div2 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G17          23
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G17           ((u32)0x00000003 << 23)                             /*!<R 0x0  mbist_nn_clkCore_g17 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G16          20
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G16           ((u32)0x00000007 << 20)                             /*!<R 0x0  mbist_nn_clkCore_g16 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G15          14
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G15           ((u32)0x0000003F << 14)                             /*!<R 0x0  mbist_nn_clkCore_g15 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G14          10
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G14           ((u32)0x0000000F << 10)                             /*!<R 0x0  mbist_nn_clkCore_g14 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G13          8
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G13           ((u32)0x00000003 << 8)                              /*!<R 0x0  mbist_nn_clkCore_g13 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_NN_CLKCORE_G12          0
#define VNDR_MASK_NRML_FAIL_NN_CLKCORE_G12           ((u32)0x000000FF << 0)                              /*!<R 0x0  mbist_nn_clkCore_g12 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_11
 * @brief                                            (@ 0X10C)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED33                        22
#define VNDR_MASK_RESERVED33                         ((u32)0x000003FF << 22)                             /*!<R 0x0   */
#define VNDR_SHIFT_NRML_FAIL_RXI316_1P               17
#define VNDR_MASK_NRML_FAIL_RXI316_1P                ((u32)0x0000001F << 17)                             /*!<R 0x0  mbist_rxi316_1p 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_RXI316_2P               14
#define VNDR_MASK_NRML_FAIL_RXI316_2P                ((u32)0x00000007 << 14)                             /*!<R 0x0  mbist_rxi316_2p 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_PLATFORM_GRP            6
#define VNDR_MASK_NRML_FAIL_PLATFORM_GRP             ((u32)0x000000FF << 6)                              /*!<R 0x0  mbist_platform_grp 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_SHARE_MEM_BT            0
#define VNDR_MASK_NRML_FAIL_SHARE_MEM_BT             ((u32)0x0000003F << 0)                              /*!<R 0x0  mbist_share_mem_bt 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_12
 * @brief                                            (@ 0X110)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED34                        27
#define VNDR_MASK_RESERVED34                         ((u32)0x0000001F << 27)                             /*!<-    */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP02             13
#define VNDR_MASK_NRML_FAIL_ENC_GROUP02              ((u32)0x00003FFF << 13)                             /*!<R 0x0  mbist_enc_group02 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP01             0
#define VNDR_MASK_NRML_FAIL_ENC_GROUP01              ((u32)0x00001FFF << 0)                              /*!<R 0x0  mbist_enc_group01 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_13
 * @brief                                            (@ 0X114)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP04             14
#define VNDR_MASK_NRML_FAIL_ENC_GROUP04              ((u32)0x0003FFFF << 14)                             /*!<R 0x0  mbist_enc_group04 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP03_2           2
#define VNDR_MASK_NRML_FAIL_ENC_GROUP03_2            ((u32)0x00000FFF << 2)                              /*!<R 0x0  mbist_enc_group03_2 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP03_1           0
#define VNDR_MASK_NRML_FAIL_ENC_GROUP03_1            ((u32)0x00000003 << 0)                              /*!<R 0x0  mbist_enc_group03_1 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_14
 * @brief                                            (@ 0X118)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED35                        24
#define VNDR_MASK_RESERVED35                         ((u32)0x000000FF << 24)                             /*!<-    */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP05_2           6
#define VNDR_MASK_NRML_FAIL_ENC_GROUP05_2            ((u32)0x0003FFFF << 6)                              /*!<R 0x0  mbist_enc_group05_2 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP05_1           0
#define VNDR_MASK_NRML_FAIL_ENC_GROUP05_1            ((u32)0x0000003F << 0)                              /*!<R 0x0  mbist_enc_group05_1 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_15
 * @brief                                            (@ 0X11C)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED36                        28
#define VNDR_MASK_RESERVED36                         ((u32)0x0000000F << 28)                             /*!<R 0x0   */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP08             22
#define VNDR_MASK_NRML_FAIL_ENC_GROUP08              ((u32)0x0000003F << 22)                             /*!<R 0x0  mbist_enc_group08 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP07             11
#define VNDR_MASK_NRML_FAIL_ENC_GROUP07              ((u32)0x000007FF << 11)                             /*!<R 0x0  mbist_enc_group07 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP06             0
#define VNDR_MASK_NRML_FAIL_ENC_GROUP06              ((u32)0x000007FF << 0)                              /*!<R 0x0  mbist_enc_group06 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_16
 * @brief                                            (@ 0X120)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED37                        15
#define VNDR_MASK_RESERVED37                         ((u32)0x0001FFFF << 15)                             /*!<R 0x0   */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP09             0
#define VNDR_MASK_NRML_FAIL_ENC_GROUP09              ((u32)0x00007FFF << 0)                              /*!<R 0x0  mbist_enc_group09 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_17
 * @brief                                            (@ 0X124)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED38                        26
#define VNDR_MASK_RESERVED38                         ((u32)0x0000003F << 26)                             /*!<R 0x0   */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP10_2           25
#define VNDR_BIT_NRML_FAIL_ENC_GROUP10_2             ((u32)0x00000001 << 25)                             /*!<R 0x0  mbist_enc_group10_2 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP10_1           0
#define VNDR_MASK_NRML_FAIL_ENC_GROUP10_1            ((u32)0x01FFFFFF << 0)                              /*!<R 0x0  mbist_enc_group10_1 1: memory normal test fail 0: memory normal test pass */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_NRML_FAIL_RAM_18
 * @brief                                            (@ 0X128)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED39                        29
#define VNDR_MASK_RESERVED39                         ((u32)0x00000007 << 29)                             /*!<R 0x0   */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP11_2           27
#define VNDR_MASK_NRML_FAIL_ENC_GROUP11_2            ((u32)0x00000003 << 27)                             /*!<R 0x0  mbist_enc_group11_2 1: memory normal test fail 0: memory normal test pass */
#define VNDR_SHIFT_NRML_FAIL_ENC_GROUP11_1           0
#define VNDR_MASK_NRML_FAIL_ENC_GROUP11_1            ((u32)0x07FFFFFF << 0)                              /*!<R 0x0  mbist_enc_group11_1 1: memory normal test fail 0: memory normal test pass */
/** @} */

