Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vndr_type.h
/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_START_PAUSE_RAM_0
 * @brief                                            (@ 0X188)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RSTN_ACBB2_ITLV_A                 31
#define VNDR_BIT_RSTN_ACBB2_ITLV_A                   ((u32)0x00000001 << 31)                             /*!<R 0x0  mbist_acbb2_itlv_a 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_SOML_STBC              30
#define VNDR_BIT_RSTN_ACBB2_SOML_STBC                ((u32)0x00000001 << 30)                             /*!<R 0x0  mbist_acbb2_soml_stbc 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_PTCSI                  29
#define VNDR_BIT_RSTN_ACBB2_PTCSI                    ((u32)0x00000001 << 29)                             /*!<R 0x0  mbist_acbb2_ptcsi 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_FFT_NOISE_POWER        28
#define VNDR_BIT_RSTN_ACBB2_FFT_NOISE_POWER          ((u32)0x00000001 << 28)                             /*!<R 0x0  mbist_acbb2_fft_noise_power 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_HWIGI_TXINFO_TABLE     27
#define VNDR_BIT_RSTN_ACBB2_HWIGI_TXINFO_TABLE       ((u32)0x00000001 << 27)                             /*!<R 0x0  mbist_acbb2_hwigi_txinfo_table 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_MF_2ND20               26
#define VNDR_BIT_RSTN_ACBB2_MF_2ND20                 ((u32)0x00000001 << 26)                             /*!<R 0x0  mbist_acbb2_mf_2nd20 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_MF_DELAY               25
#define VNDR_BIT_RSTN_ACBB2_MF_DELAY                 ((u32)0x00000001 << 25)                             /*!<R 0x0  mbist_acbb2_mf_delay 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_SHARE_DELAY_SND        24
#define VNDR_BIT_RSTN_ACBB2_SHARE_DELAY_SND          ((u32)0x00000001 << 24)                             /*!<R 0x0  mbist_acbb2_share_delay_snd 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_SHARE_DELAY_PRI        23
#define VNDR_BIT_RSTN_ACBB2_SHARE_DELAY_PRI          ((u32)0x00000001 << 23)                             /*!<R 0x0  mbist_acbb2_share_delay_pri 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_SBD                    22
#define VNDR_BIT_RSTN_ACBB2_SBD                      ((u32)0x00000001 << 22)                             /*!<R 0x0  mbist_acbb2_sbd 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_SBD_GI                 21
#define VNDR_BIT_RSTN_ACBB2_SBD_GI                   ((u32)0x00000001 << 21)                             /*!<R 0x0  mbist_acbb2_sbd_GI 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_DFS_PWDB_FIFO          20
#define VNDR_BIT_RSTN_ACBB2_DFS_PWDB_FIFO            ((u32)0x00000001 << 20)                             /*!<R 0x0  mbist_acbb2_dfs_pwdb_fifo 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_DFS_FFT_FIFO           19
#define VNDR_BIT_RSTN_ACBB2_DFS_FFT_FIFO             ((u32)0x00000001 << 19)                             /*!<R 0x0  mbist_acbb2_dfs_fft_fifo 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_RPT_KEEPER             18
#define VNDR_BIT_RSTN_ACBB2_RPT_KEEPER               ((u32)0x00000001 << 18)                             /*!<R 0x0  mbist_acbb2_rpt_keeper 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_ANAPAR                 17
#define VNDR_BIT_RSTN_ACBB2_ANAPAR                   ((u32)0x00000001 << 17)                             /*!<R 0x0  mbist_acbb2_anapar 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_ACBB2_RXAGC                  16
#define VNDR_BIT_RSTN_ACBB2_RXAGC                    ((u32)0x00000001 << 16)                             /*!<R 0x0  mbist_acbb2_rxagc 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMAC_AXI_TXDMA              15
#define VNDR_BIT_RSTN_WLMAC_AXI_TXDMA                ((u32)0x00000001 << 15)                             /*!<R 0x0  mbist_wlmac_axi_txdma 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMCU_IRAM                   14
#define VNDR_BIT_RSTN_WLMCU_IRAM                     ((u32)0x00000001 << 14)                             /*!<R 0x0  mbist_wlmcu_iram 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMCU_ERAM1                  13
#define VNDR_BIT_RSTN_WLMCU_ERAM1                    ((u32)0x00000001 << 13)                             /*!<R 0x0  mbist_wlmcu_eram1 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMCU_ERAM0                  12
#define VNDR_BIT_RSTN_WLMCU_ERAM0                    ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_wlmcu_eram0 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMCU_DRAM                   11
#define VNDR_BIT_RSTN_WLMCU_DRAM                     ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_wlmcu_dram 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMAC_TXRPTBUFFER            10
#define VNDR_BIT_RSTN_WLMAC_TXRPTBUFFER              ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_wlmac_txrptbuffer 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMAC_RXPKTBUFFER            9
#define VNDR_BIT_RSTN_WLMAC_RXPKTBUFFER              ((u32)0x00000001 << 9)                              /*!<R 0x0  mbist_wlmac_rxpktbuffer 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMAC_TXPKTBUFFER1           8
#define VNDR_BIT_RSTN_WLMAC_TXPKTBUFFER1             ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_wlmac_txpktbuffer1 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMAC_TXPKTBUFFER0           7
#define VNDR_BIT_RSTN_WLMAC_TXPKTBUFFER0             ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_wlmac_txpktbuffer0 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMAC_TXLLT                  6
#define VNDR_BIT_RSTN_WLMAC_TXLLT                    ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_wlmac_txllt 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMAC_MACTX_FIFO             5
#define VNDR_BIT_RSTN_WLMAC_MACTX_FIFO               ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_wlmac_mactx_fifo 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMAC_MACRX_FIFO             4
#define VNDR_BIT_RSTN_WLMAC_MACRX_FIFO               ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_wlmac_macrx_fifo 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMAC_TKIPRC4                3
#define VNDR_BIT_RSTN_WLMAC_TKIPRC4                  ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_wlmac_tkiprc4 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMAC_PSF                    2
#define VNDR_BIT_RSTN_WLMAC_PSF                      ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_wlmac_psf 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_RSTN_WLMAC_RXBACAM                1
#define VNDR_BIT_RSTN_WLMAC_RXBACAM                  ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_wlmac_rxbacam 1: release rstn for mbist logic, enable this mbist group 0: keep this mbist group logic in reset */
#define VNDR_SHIFT_START_PAUSE_WLMAC_KEYSRCH         0
#define VNDR_BIT_START_PAUSE_WLMAC_KEYSRCH           ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_wlmac_keysrch 1: drf test pause 0: drf test not paused */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_START_PAUSE_RAM_1
 * @brief                                            (@ 0X18C)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_START_PAUSE_BT_04                 31
#define VNDR_BIT_START_PAUSE_BT_04                   ((u32)0x00000001 << 31)                             /*!<R 0x0  mbist_bt_04 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_START_PAUSE_BT_03                 30
#define VNDR_BIT_START_PAUSE_BT_03                   ((u32)0x00000001 << 30)                             /*!<R 0x0  mbist_bt_03 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_START_PAUSE_BT_02                 29
#define VNDR_BIT_START_PAUSE_BT_02                   ((u32)0x00000001 << 29)                             /*!<R 0x0  mbist_bt_02 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_RESERVED59                        28
#define VNDR_BIT_RESERVED59                          ((u32)0x00000001 << 28)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED60                        27
#define VNDR_BIT_RESERVED60                          ((u32)0x00000001 << 27)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED61                        26
#define VNDR_BIT_RESERVED61                          ((u32)0x00000001 << 26)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED62                        25
#define VNDR_BIT_RESERVED62                          ((u32)0x00000001 << 25)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED63                        24
#define VNDR_BIT_RESERVED63                          ((u32)0x00000001 << 24)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED64                        23
#define VNDR_BIT_RESERVED64                          ((u32)0x00000001 << 23)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED65                        22
#define VNDR_BIT_RESERVED65                          ((u32)0x00000001 << 22)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_RESERVED66                        21
#define VNDR_BIT_RESERVED66                          ((u32)0x00000001 << 21)                             /*!<R 0x0  -- */
#define VNDR_SHIFT_ACBB2_CCK_CCA                     20
#define VNDR_BIT_ACBB2_CCK_CCA                       ((u32)0x00000001 << 20)                             /*!<R 0x0  mbist_acbb2_cck_cca 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_TMETER                      19
#define VNDR_BIT_ACBB2_TMETER                        ((u32)0x00000001 << 19)                             /*!<R 0x0  mbist_acbb2_Tmeter 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_PWSF                        18
#define VNDR_BIT_ACBB2_PWSF                          ((u32)0x00000001 << 18)                             /*!<R 0x0  mbist_acbb2_pwsf 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_IQK_DPD                     17
#define VNDR_BIT_ACBB2_IQK_DPD                       ((u32)0x00000001 << 17)                             /*!<R 0x0  mbist_acbb2_iqk_dpd 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_SYNC                        16
#define VNDR_BIT_ACBB2_SYNC                          ((u32)0x00000001 << 16)                             /*!<R 0x0  mbist_acbb2_sync 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_NCTL                        15
#define VNDR_BIT_ACBB2_NCTL                          ((u32)0x00000001 << 15)                             /*!<R 0x0  mbist_acbb2_nctl 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_VITERBI                     14
#define VNDR_BIT_ACBB2_VITERBI                       ((u32)0x00000001 << 14)                             /*!<R 0x0  mbist_acbb2_viterbi 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_BFEE                        13
#define VNDR_BIT_ACBB2_BFEE                          ((u32)0x00000001 << 13)                             /*!<R 0x0  mbist_acbb2_Bfee 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_SHARE_FEQ_IN_DELAY          12
#define VNDR_BIT_ACBB2_SHARE_FEQ_IN_DELAY            ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_acbb2_share_feq_in_delay 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_SHARE_FEQ_IN_T0             11
#define VNDR_BIT_ACBB2_SHARE_FEQ_IN_T0               ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_acbb2_share_feq_in_t0 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_H_STS_PATH1                 10
#define VNDR_BIT_ACBB2_H_STS_PATH1                   ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_acbb2_H_sts_path1 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_H_STS_PATH0                 9
#define VNDR_BIT_ACBB2_H_STS_PATH0                   ((u32)0x00000001 << 9)                              /*!<R 0x0  mbist_acbb2_H_sts_path0 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_PRECCA_POWCAL               8
#define VNDR_BIT_ACBB2_PRECCA_POWCAL                 ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_acbb2_precca_powcal 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_NOISE_POW                   7
#define VNDR_BIT_ACBB2_NOISE_POW                     ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_acbb2_noise_pow 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_PILOT_TRACKING              6
#define VNDR_BIT_ACBB2_PILOT_TRACKING                ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_acbb2_pilot_tracking 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_FOE_LLTF                    5
#define VNDR_BIT_ACBB2_FOE_LLTF                      ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_acbb2_foe_lltf 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_GI_BUFF                     4
#define VNDR_BIT_ACBB2_GI_BUFF                       ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_acbb2_gi_buff 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_DLY_512                     3
#define VNDR_BIT_ACBB2_DLY_512                       ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_acbb2_dly_512 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_FFTBUF                      2
#define VNDR_BIT_ACBB2_FFTBUF                        ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_acbb2_fftbuf 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_FFT                         1
#define VNDR_BIT_ACBB2_FFT                           ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_acbb2_fft 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ACBB2_ITLV_B                      0
#define VNDR_BIT_ACBB2_ITLV_B                        ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_acbb2_itlv_b 1: drf test pause 0: drf test not paused */
/** @} */

