Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vndr_type.h
/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_START_PAUSE_RAM_2
 * @brief                                            (@ 0X190)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_VOE_FBCU_OBUF_BUF1                31
#define VNDR_BIT_VOE_FBCU_OBUF_BUF1                  ((u32)0x00000001 << 31)                             /*!<R 0x0  mbist_voe_fbcu_obuf_buf1 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_VOE_FBCU_OBUF_BUF0                30
#define VNDR_BIT_VOE_FBCU_OBUF_BUF0                  ((u32)0x00000001 << 30)                             /*!<R 0x0  mbist_voe_fbcu_obuf_buf0 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_VOE_SHARED_SRAM                   29
#define VNDR_BIT_VOE_SHARED_SRAM                     ((u32)0x00000001 << 29)                             /*!<R 0x0  mbist_voe_shared_sram 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_VOEMCU_DTCM                       28
#define VNDR_BIT_VOEMCU_DTCM                         ((u32)0x00000001 << 28)                             /*!<R 0x0  mbist_voemcu_dtcm 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_VOEMCU_ITCM_RAM                   27
#define VNDR_BIT_VOEMCU_ITCM_RAM                     ((u32)0x00000001 << 27)                             /*!<R 0x0  mbist_voemcu_itcm_ram 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_CPU_ITCM_RAM                      26
#define VNDR_BIT_CPU_ITCM_RAM                        ((u32)0x00000001 << 26)                             /*!<R 0x0  mbist_cpu_itcm_ram 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_CPU_PHT_BTB                       25
#define VNDR_BIT_CPU_PHT_BTB                         ((u32)0x00000001 << 25)                             /*!<R 0x0  mbist_cpu_pht_btb 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_CPU_IC                            24
#define VNDR_BIT_CPU_IC                              ((u32)0x00000001 << 24)                             /*!<R 0x0  mbist_cpu_ic 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_CPU_DC                            23
#define VNDR_BIT_CPU_DC                              ((u32)0x00000001 << 23)                             /*!<R 0x0  mbist_cpu_dc 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_CPU_DTCM_RAM                      22
#define VNDR_BIT_CPU_DTCM_RAM                        ((u32)0x00000001 << 22)                             /*!<R 0x0  mbist_cpu_dtcm_ram 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_SDMMC_PPBECC                      21
#define VNDR_BIT_SDMMC_PPBECC                        ((u32)0x00000001 << 21)                             /*!<R 0x0  mbist_sdmmc_ppbecc 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_SDMMC_DMASB1                      20
#define VNDR_BIT_SDMMC_DMASB1                        ((u32)0x00000001 << 20)                             /*!<R 0x0  mbist_sdmmc_dmasb1 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_USBOTG                            19
#define VNDR_BIT_USBOTG                              ((u32)0x00000001 << 19)                             /*!<R 0x0  mbist_usbotg 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_SDIO                              18
#define VNDR_BIT_SDIO                                ((u32)0x00000001 << 18)                             /*!<R 0x0  mbist_sdio 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_MIPI                              17
#define VNDR_BIT_MIPI                                ((u32)0x00000001 << 17)                             /*!<R 0x0  mbist_mipi 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_OSDBRIDGE                         16
#define VNDR_BIT_OSDBRIDGE                           ((u32)0x00000001 << 16)                             /*!<R 0x0  mbist_osdbridge 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_OSDPAINTER                        15
#define VNDR_BIT_OSDPAINTER                          ((u32)0x00000001 << 15)                             /*!<R 0x0  mbist_osdpainter 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_VIDEO_AMBA                        14
#define VNDR_BIT_VIDEO_AMBA                          ((u32)0x00000001 << 14)                             /*!<R 0x0  mbist_video_amba 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ISP_DMA3                          13
#define VNDR_BIT_ISP_DMA3                            ((u32)0x00000001 << 13)                             /*!<R 0x0  mbist_isp_dma3 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ISPH_VHDR_ADD                     12
#define VNDR_BIT_ISPH_VHDR_ADD                       ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_isph VHDR add 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ISPG                              11
#define VNDR_BIT_ISPG                                ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_ispg 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ISPF                              10
#define VNDR_BIT_ISPF                                ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_ispf 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ISPE                              9
#define VNDR_BIT_ISPE                                ((u32)0x00000001 << 9)                              /*!<R 0x0  mbist_ispe 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ISPD                              8
#define VNDR_BIT_ISPD                                ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_ispd 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ISPC                              7
#define VNDR_BIT_ISPC                                ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_ispc 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ISPB                              6
#define VNDR_BIT_ISPB                                ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_ispb 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ISPA                              5
#define VNDR_BIT_ISPA                                ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_ispa 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_GMAC_SRAM                         4
#define VNDR_BIT_GMAC_SRAM                           ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_gmac_sram 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_BT_CPU                            3
#define VNDR_BIT_BT_CPU                              ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_bt_cpu 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_BT_07                             2
#define VNDR_BIT_BT_07                               ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_bt_07 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_BT_06                             1
#define VNDR_BIT_BT_06                               ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_bt_06 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_BT_05                             0
#define VNDR_BIT_BT_05                               ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_bt_05 1: drf test pause 0: drf test not paused */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_START_PAUSE_RAM_3
 * @brief                                            (@ 0X194)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_ENC_GROUP05_1                     31
#define VNDR_BIT_ENC_GROUP05_1                       ((u32)0x00000001 << 31)                             /*!<R 0x0  mbist_enc_group05_1 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP04                       30
#define VNDR_BIT_ENC_GROUP04                         ((u32)0x00000001 << 30)                             /*!<R 0x0  mbist_enc_group04 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP03_2                     29
#define VNDR_BIT_ENC_GROUP03_2                       ((u32)0x00000001 << 29)                             /*!<R 0x0  mbist_enc_group03_2 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP03_1                     28
#define VNDR_BIT_ENC_GROUP03_1                       ((u32)0x00000001 << 28)                             /*!<R 0x0  mbist_enc_group03_1 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP02                       27
#define VNDR_BIT_ENC_GROUP02                         ((u32)0x00000001 << 27)                             /*!<R 0x0  mbist_enc_group02 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP01                       26
#define VNDR_BIT_ENC_GROUP01                         ((u32)0x00000001 << 26)                             /*!<R 0x0  mbist_enc_group01 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_RXI316_1P                         25
#define VNDR_BIT_RXI316_1P                           ((u32)0x00000001 << 25)                             /*!<R 0x0  mbist_rxi316_1p 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_RXI316_2P                         24
#define VNDR_BIT_RXI316_2P                           ((u32)0x00000001 << 24)                             /*!<R 0x0  mbist_rxi316_2p 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_PLATFORM_GRP                      23
#define VNDR_BIT_PLATFORM_GRP                        ((u32)0x00000001 << 23)                             /*!<R 0x0  mbist_platform_grp 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_SHARE_MEM_BT                      22
#define VNDR_BIT_SHARE_MEM_BT                        ((u32)0x00000001 << 22)                             /*!<R 0x0  mbist_share_mem_bt 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_ACLK                           21
#define VNDR_BIT_NN_ACLK                             ((u32)0x00000001 << 21)                             /*!<R 0x0  mbist_nn_ACLK 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKSH_DIV2                     20
#define VNDR_BIT_NN_CLKSH_DIV2                       ((u32)0x00000001 << 20)                             /*!<R 0x0  mbist_nn_clkSh_div2 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G17                    19
#define VNDR_BIT_NN_CLKCORE_G17                      ((u32)0x00000001 << 19)                             /*!<R 0x0  mbist_nn_clkCore_g17 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G16                    18
#define VNDR_BIT_NN_CLKCORE_G16                      ((u32)0x00000001 << 18)                             /*!<R 0x0  mbist_nn_clkCore_g16 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G15                    17
#define VNDR_BIT_NN_CLKCORE_G15                      ((u32)0x00000001 << 17)                             /*!<R 0x0  mbist_nn_clkCore_g15 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G14                    16
#define VNDR_BIT_NN_CLKCORE_G14                      ((u32)0x00000001 << 16)                             /*!<R 0x0  mbist_nn_clkCore_g14 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G13                    15
#define VNDR_BIT_NN_CLKCORE_G13                      ((u32)0x00000001 << 15)                             /*!<R 0x0  mbist_nn_clkCore_g13 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G12                    14
#define VNDR_BIT_NN_CLKCORE_G12                      ((u32)0x00000001 << 14)                             /*!<R 0x0  mbist_nn_clkCore_g12 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G11                    13
#define VNDR_BIT_NN_CLKCORE_G11                      ((u32)0x00000001 << 13)                             /*!<R 0x0  mbist_nn_clkCore_g11 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G10                    12
#define VNDR_BIT_NN_CLKCORE_G10                      ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_nn_clkCore_g10 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G9                     11
#define VNDR_BIT_NN_CLKCORE_G9                       ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_nn_clkCore_g9 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G8                     10
#define VNDR_BIT_NN_CLKCORE_G8                       ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_nn_clkCore_g8 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G7                     9
#define VNDR_BIT_NN_CLKCORE_G7                       ((u32)0x00000001 << 9)                              /*!<R 0x0  mbist_nn_clkCore_g7 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G6                     8
#define VNDR_BIT_NN_CLKCORE_G6                       ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_nn_clkCore_g6 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G5                     7
#define VNDR_BIT_NN_CLKCORE_G5                       ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_nn_clkCore_g5 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G4                     6
#define VNDR_BIT_NN_CLKCORE_G4                       ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_nn_clkCore_g4 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G3                     5
#define VNDR_BIT_NN_CLKCORE_G3                       ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_nn_clkCore_g3 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G2                     4
#define VNDR_BIT_NN_CLKCORE_G2                       ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_nn_clkCore_g2 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G1                     3
#define VNDR_BIT_NN_CLKCORE_G1                       ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_nn_clkCore_g1 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_NN_CLKCORE_G0                     2
#define VNDR_BIT_NN_CLKCORE_G0                       ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_nn_clkCore_g0 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_VOE_CPU_DCACHE                    1
#define VNDR_BIT_VOE_CPU_DCACHE                      ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_voe_cpu_dcache 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_VOE_CPU_ICACHE                    0
#define VNDR_BIT_VOE_CPU_ICACHE                      ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_voe_cpu_icache 1: drf test pause 0: drf test not paused */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_START_PAUSE_RAM_4
 * @brief                                            (@ 0X198)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_RESERVED67                        16
#define VNDR_MASK_RESERVED67                         ((u32)0x0000FFFF << 16)                             /*!<R 0x0   */
#define VNDR_SHIFT_BSTC_HWPAT                        15
#define VNDR_BIT_BSTC_HWPAT                          ((u32)0x00000001 << 15)                             /*!<R 0x0  mbist_bstc_hwpat 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_RSA                               14
#define VNDR_BIT_RSA                                 ((u32)0x00000001 << 14)                             /*!<R 0x0  mbist_RSA 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP14                       13
#define VNDR_BIT_ENC_GROUP14                         ((u32)0x00000001 << 13)                             /*!<R 0x0  mbist_enc_group14 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP13_2                     12
#define VNDR_BIT_ENC_GROUP13_2                       ((u32)0x00000001 << 12)                             /*!<R 0x0  mbist_enc_group13_2 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP13_1                     11
#define VNDR_BIT_ENC_GROUP13_1                       ((u32)0x00000001 << 11)                             /*!<R 0x0  mbist_enc_group13_1 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP12_2                     10
#define VNDR_BIT_ENC_GROUP12_2                       ((u32)0x00000001 << 10)                             /*!<R 0x0  mbist_enc_group12_2 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP12_1                     9
#define VNDR_BIT_ENC_GROUP12_1                       ((u32)0x00000001 << 9)                              /*!<R 0x0  mbist_enc_group12_1 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP11_2                     8
#define VNDR_BIT_ENC_GROUP11_2                       ((u32)0x00000001 << 8)                              /*!<R 0x0  mbist_enc_group11_2 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP11_1                     7
#define VNDR_BIT_ENC_GROUP11_1                       ((u32)0x00000001 << 7)                              /*!<R 0x0  mbist_enc_group11_1 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP10_2                     6
#define VNDR_BIT_ENC_GROUP10_2                       ((u32)0x00000001 << 6)                              /*!<R 0x0  mbist_enc_group10_2 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP10_1                     5
#define VNDR_BIT_ENC_GROUP10_1                       ((u32)0x00000001 << 5)                              /*!<R 0x0  mbist_enc_group10_1 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP09                       4
#define VNDR_BIT_ENC_GROUP09                         ((u32)0x00000001 << 4)                              /*!<R 0x0  mbist_enc_group09 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP08                       3
#define VNDR_BIT_ENC_GROUP08                         ((u32)0x00000001 << 3)                              /*!<R 0x0  mbist_enc_group08 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP07                       2
#define VNDR_BIT_ENC_GROUP07                         ((u32)0x00000001 << 2)                              /*!<R 0x0  mbist_enc_group07 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP06                       1
#define VNDR_BIT_ENC_GROUP06                         ((u32)0x00000001 << 1)                              /*!<R 0x0  mbist_enc_group06 1: drf test pause 0: drf test not paused */
#define VNDR_SHIFT_ENC_GROUP05_2                     0
#define VNDR_BIT_ENC_GROUP05_2                       ((u32)0x00000001 << 0)                              /*!<R 0x0  mbist_enc_group05_2 1: drf test pause 0: drf test not paused */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_ROM_0
 * @brief                                            (@ 0X19C)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_REG_ROM_MISR_DOUT                 0
#define VNDR_MASK_REG_ROM_MISR_DOUT                  ((u32)0xFFFFFFFF << 0)                              /*!<R 0x0  reg_misr_dout */
/** @} */

/**************************************************************************//**
 * @defgroup VNDR_REG_MBIST_ROM_1
 * @brief                                            (@ 0X1A0)
 * @{
 *****************************************************************************/
#define VNDR_SHIFT_REG_ROM_MISR_DOUT                 0
#define VNDR_MASK_REG_ROM_MISR_DOUT                  ((u32)0xFFFFFFFF << 0)                              /*!<R 0x0  reg_misr_dout */
/** @} */

