Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_vndr_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_VNDR
 * @{
 * @brief rtl8735b_VNDR Register Declaration
 *****************************************************************************/
typedef struct {
	__I  uint32_t VNDR_REG_RSVD1 ;                         /*!<   register,  Address offset: 0x000 */
	__I  uint32_t VNDR_REG_LOW_PRI_INT_MODE ;              /*!<   register,  Address offset: 0x004 */
	__I  uint32_t VNDR_REG_LOW_PRI_INT_IMR ;               /*!<   register,  Address offset: 0x008 */
	__I  uint32_t VNDR_REG_LOW_PRI_INT_ISR ;               /*!<   register,  Address offset: 0x00C */
	__I  uint32_t VNDR_REG_RSVD2 ;                         /*!<   register,  Address offset: 0x010 */
	__IO uint32_t VNDR_REG_ANACK_CAL_CTRL ;                /*!<   register,  Address offset: 0x014 */
	__IO uint32_t VNDR_REG_RSVD3 ;                         /*!<   register,  Address offset: 0x018 */
	__O  uint32_t VNDR_REG_RSVD4 ;                         /*!<   register,  Address offset: 0x01C */
	__IO uint32_t VNDR_REG_DATA_FIFO_SWAP_CTRL ;           /*!<   register,  Address offset: 0x020 */
	__I  uint32_t VNDR_REG_I2C_DGLCH_CTRL ;                /*!<   register,  Address offset: 0x024 */
	__O  uint32_t VNDR_REG_RSVD5 ;                         /*!<   register,  Address offset: 0x028 */
	__O  uint32_t VNDR_REG_RSVD6 ;                         /*!<   register,  Address offset: 0x02C */
	__I  uint32_t VNDR_REG_GDMA0_ISR ;                     /*!<   register,  Address offset: 0x030 */
	__I  uint32_t VNDR_REG_GDMA1_ISR ;                     /*!<   register,  Address offset: 0x034 */
	__I  uint32_t VNDR_REG_SGPIO_ISR ;                     /*!<   register,  Address offset: 0x038 */
	__I  uint32_t VNDR_REG_UART_ISR ;                      /*!<   register,  Address offset: 0x03C */
	__I  uint32_t VNDR_REG_I2C_ISR ;                       /*!<   register,  Address offset: 0x040 */
	__I  uint32_t VNDR_REG_SPI_ISR ;                       /*!<   register,  Address offset: 0x044 */
	__I  uint32_t VNDR_REG_I2S_ISR ;                       /*!<   register,  Address offset: 0x048 */
	__I  uint32_t VNDR_REG_WL_ISR ;                        /*!<   register,  Address offset: 0x04C */
	__IO uint32_t VNDR_REG_RSVD7 ;                         /*!<   register,  Address offset: 0x050 */
	__IO uint32_t VNDR_REG_RSVD8 ;                         /*!<   register,  Address offset: 0x054 */
	__IO uint32_t VNDR_REG_RSVD9 ;                         /*!<   register,  Address offset: 0x058 */
	__IO uint32_t VNDR_REG_RSVDA ;                         /*!<   register,  Address offset: 0x05C */
	__IO uint32_t VNDR_REG_GDMA_HSKS_CTRL ;                /*!<   register,  Address offset: 0x060 */
	__IO uint32_t VNDR_REG_RSVDB ;                         /*!<   register,  Address offset: 0x064 */
	__IO uint32_t VNDR_REG_RSVDC ;                         /*!<   register,  Address offset: 0x068 */
	__IO uint32_t VNDR_REG_RSVDD ;                         /*!<   register,  Address offset: 0x06C */
	__IO uint32_t VNDR_REG_RSVDE ;                         /*!<   register,  Address offset: 0x070 */
	__IO uint32_t VNDR_REG_RSVDF ;                         /*!<   register,  Address offset: 0x074 */
	__IO uint32_t VNDR_REG_RSVDG ;                         /*!<   register,  Address offset: 0x078 */
	__IO uint32_t VNDR_REG_RSVDH ;                         /*!<   register,  Address offset: 0x07C */
	__IO uint32_t VNDR_REG_RSVDI ;                         /*!<   register,  Address offset: 0x080 */
	__IO uint32_t VNDR_REG_RSVDJ ;                         /*!<   register,  Address offset: 0x084 */
	__IO uint32_t VNDR_REG_RSVDK ;                         /*!<   register,  Address offset: 0x088 */
	__IO uint32_t VNDR_REG_RSVDL ;                         /*!<   register,  Address offset: 0x08C */
	__IO uint32_t VNDR_REG_LX_CTRL0 ;                      /*!<   register,  Address offset: 0x090 */
	__I  uint32_t VNDR_REG_LX_CTRL1 ;                      /*!<   register,  Address offset: 0x094 */
	__I  uint32_t VNDR_REG_LX_CTRL2 ;                      /*!<   register,  Address offset: 0x098 */
	__I  uint32_t VNDR_REG_LX_CTRL3 ;                      /*!<   register,  Address offset: 0x09C */
	__IO uint32_t VNDR_REG_MBIST_RSTN_RAM_0 ;              /*!<   register,  Address offset: 0x0A0 */
	__IO uint32_t VNDR_REG_MBIST_RSTN_RAM_1 ;              /*!<   register,  Address offset: 0x0A4 */
	__IO uint32_t VNDR_REG_MBIST_RSTN_RAM_2 ;              /*!<   register,  Address offset: 0x0A8 */
	__IO uint32_t VNDR_REG_MBIST_RSTN_RAM_3 ;              /*!<   register,  Address offset: 0x0AC */
	__IO uint32_t VNDR_REG_MBIST_RSTN_RAM_4 ;              /*!<   register,  Address offset: 0x0B0 */
	__IO uint32_t VNDR_REG_MBIST_RSTN_ROM ;                /*!<   register,  Address offset: 0x0B4 */
	__IO uint32_t VNDR_REG_MBIST_CTRL_0 ;                  /*!<   register,  Address offset: 0x0B8 */
	__IO uint32_t VNDR_REG_MBIST_CTRL_1 ;                  /*!<   register,  Address offset: 0x0BC */
	__I  uint32_t VNDR_REG_MBIST_CTRL_2 ;                  /*!<   register,  Address offset: 0x0C0 */
	__I  uint32_t VNDR_REG_MBIST_STATUS ;                  /*!<   register,  Address offset: 0x0C4 */
	__I  uint32_t VNDR_REG_MBIST_DONE_RAM_0 ;              /*!<   register,  Address offset: 0x0C8 */
	__I  uint32_t VNDR_REG_MBIST_DONE_RAM_1 ;              /*!<   register,  Address offset: 0x0CC */
	__I  uint32_t VNDR_REG_MBIST_DONE_RAM_2 ;              /*!<   register,  Address offset: 0x0D0 */
	__I  uint32_t VNDR_REG_MBIST_DONE_RAM_3 ;              /*!<   register,  Address offset: 0x0D4 */
	__I  uint32_t VNDR_REG_MBIST_DONE_RAM_4 ;              /*!<   register,  Address offset: 0x0D8 */
	__I  uint32_t VNDR_REG_MBIST_DONE_ROM ;                /*!<   register,  Address offset: 0x0DC */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_0 ;         /*!<   register,  Address offset: 0x0E0 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_1 ;         /*!<   register,  Address offset: 0x0E4 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_2 ;         /*!<   register,  Address offset: 0x0E8 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_3 ;         /*!<   register,  Address offset: 0x0EC */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_4 ;         /*!<   register,  Address offset: 0x0F0 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_5 ;         /*!<   register,  Address offset: 0x0F4 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_6 ;         /*!<   register,  Address offset: 0x0F8 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_7 ;         /*!<   register,  Address offset: 0x0FC */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_8 ;         /*!<   register,  Address offset: 0x100 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_9 ;         /*!<   register,  Address offset: 0x104 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_10 ;        /*!<   register,  Address offset: 0x108 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_11 ;        /*!<   register,  Address offset: 0x10C */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_12 ;        /*!<   register,  Address offset: 0x110 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_13 ;        /*!<   register,  Address offset: 0x114 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_14 ;        /*!<   register,  Address offset: 0x118 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_15 ;        /*!<   register,  Address offset: 0x11C */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_16 ;        /*!<   register,  Address offset: 0x120 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_17 ;        /*!<   register,  Address offset: 0x124 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_18 ;        /*!<   register,  Address offset: 0x128 */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_19 ;        /*!<   register,  Address offset: 0x12C */
	__I  uint32_t VNDR_REG_MBIST_NRML_FAIL_RAM_20 ;        /*!<   register,  Address offset: 0x130 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_0 ;          /*!<   register,  Address offset: 0x134 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_1 ;          /*!<   register,  Address offset: 0x138 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_2 ;          /*!<   register,  Address offset: 0x13C */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_3 ;          /*!<   register,  Address offset: 0x140 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_4 ;          /*!<   register,  Address offset: 0x144 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_5 ;          /*!<   register,  Address offset: 0x148 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_6 ;          /*!<   register,  Address offset: 0x14C */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_7 ;          /*!<   register,  Address offset: 0x150 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_8 ;          /*!<   register,  Address offset: 0x154 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_9 ;          /*!<   register,  Address offset: 0x158 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_10 ;         /*!<   register,  Address offset: 0x15C */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_11 ;         /*!<   register,  Address offset: 0x160 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_12 ;         /*!<   register,  Address offset: 0x164 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_13 ;         /*!<   register,  Address offset: 0x168 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_14 ;         /*!<   register,  Address offset: 0x16C */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_15 ;         /*!<   register,  Address offset: 0x170 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_16 ;         /*!<   register,  Address offset: 0x174 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_17 ;         /*!<   register,  Address offset: 0x178 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_18 ;         /*!<   register,  Address offset: 0x17C */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_19 ;         /*!<   register,  Address offset: 0x180 */
	__I  uint32_t VNDR_REG_MBIST_DRF_FAIL_RAM_20 ;         /*!<   register,  Address offset: 0x184 */
	__I  uint32_t VNDR_REG_MBIST_START_PAUSE_RAM_0 ;       /*!<   register,  Address offset: 0x188 */
	__I  uint32_t VNDR_REG_MBIST_START_PAUSE_RAM_1 ;       /*!<   register,  Address offset: 0x18C */
	__I  uint32_t VNDR_REG_MBIST_START_PAUSE_RAM_2 ;       /*!<   register,  Address offset: 0x190 */
	__I  uint32_t VNDR_REG_MBIST_START_PAUSE_RAM_3 ;       /*!<   register,  Address offset: 0x194 */
	__I  uint32_t VNDR_REG_MBIST_START_PAUSE_RAM_4 ;       /*!<   register,  Address offset: 0x198 */
	__I  uint32_t VNDR_REG_MBIST_ROM_0 ;                   /*!<   register,  Address offset: 0x19C */
	__I  uint32_t VNDR_REG_MBIST_ROM_1 ;                   /*!<   register,          Address offset: 0x1A0 */
} VNDR_TypeDef;
/** @} */

#endif
